{"1231": ["I remember going on fly swatting sprees, and keeping a very accurate count of how many dead."], "963": ["I remember that “Dentyne” is the chewing gum most recommended by dentists."], "31": ["I remember box suits."], "557": ["I remember fantasies of growing up and adopting a child."], "903": ["I remember blue jeans blotched with bleach."], "757": ["I remember bronzed baby shoes. Shriner hats. And the Campbell Soup kids."], "393": ["I remember that my father’s favorite movie star was Rita Hayworth."], "1233": ["I remember “Tupperware” parties."], "74": ["I remember mustard seed necklaces with a mustard seed inside a little glass ball."], "628": ["I remember suddenly being aware of “how” I am holding my cigarette in queer bars."], "308": ["I remember that Eskimos kiss with their noses. (?)"], "1050": ["I remember Esther Williams’ very large face."], "456": ["I remember that Betty Grable’s legs were insured for a million dollars."], "540": ["I remember trying not to stare at people with hearing aids. (Or trying to look at them casually.)"], "1339": ["I remember jumping off the front porch head first onto the corner of a brick.", "I remember being able to see nothing but gushing red blood. This is one of the first things I remember. And I have a scar to prove it."], "401": ["I remember that I was a terrible coin collector because I was always spending them."], "841": ["I remember driving through the Ozarks and chenille bedspreads with peacocks on them hanging outside on clotheslines for sale."], "437": ["I remember always getting in trouble for giving everything away."], "683": ["I remember more than once leaving the price tag on a present."], "376": ["I remember Sen-Sen: Little black squares that taste like soap."], "210": ["I remember puffy pastel sweaters. (Angora.)"], "216": ["I remember a climbing red rose bush all over the garage. When rose time came it was practically solid red."], "274": ["I remember blond heads. White teeth. Thick necks. And certain smiles."], "939": ["I remember (out loud) the problems of “pin” and “pen.”"], "679": ["I remember how sad and happy at the same time Christmas carols always made me feel: all warm inside."], "408": ["I remember being disappointed the first time I got my teeth cleaned that they didn’t turn out real white."], "754": ["I remember pony tail clips."], "1204": ["I remember being talked about as though I wasn’t there."], "163": ["I remember on Halloween, one old lady you had to sing or dance or do something for before she would give you anything."], "392": ["I remember that my mother’s favorite movie star was June Allyson."], "2": ["I remember when polio was the worst thing in the world."], "122": ["I remember when dark green walls were popular."], "814": ["I remember folding paper into cootie catchers. And airplanes that just went down."], "608": ["I remember in a high school yearbook a big group picture where one boy in the back row was giving the finger."], "129": ["I remember loafers with pennies in them."], "205": ["I remember when I didn’t really believe in Santa Claus but I wanted to so badly that I did."], "189": ["I remember when hoop skirts had a miniature revival."], "365": ["I remember the first time I saw the ocean. I jumped right in, and it swept me right under, down, and back to shore again."], "83": ["I remember when I tried out to be a cheerleader and didn’t make it."], "858": ["I remember not really trusting mince meat pie. (What was “in” it.) And dressing too."], "798": ["I remember madras plaid shirts and sports coats and how they had to be washed a few times before they had the right look."], "1261": ["I remember not understanding the necessity of shoveling the sidewalks. It always melted in a day or two anyway.", "And besides—“It’s only snow.”"], "1381": ["I remember my grade school librarian Miss Peabody. At the beginning of each class we had to all say in unison “Good morning, Miss Peabody!”", "Only instead we said “Good morning, Miss Pee-body!” I guess she decided to ignore this because she never said anything about it.", "She was very tall and very thin and there was always a ribbon or a scarf tied around her head from which bubbled lots of silver-gray curls."], "868": ["I remember learning to dive in swimming class, because I had to, but I never dove again."], "572": ["I remember Gina Lollobrigida’s very tiny waist in Trapeze."], "578": ["I remember giant discussions with Pat and Ron Padgett, and Ted Berrigan, after seeing La Dolce Vita about what all the symbolism meant."], "85": ["I remember one football player who wore very tight faded blue jeans, and the way he filled them."], "843": ["I remember wondering why out-house doors have a sliver of a moon cut out of them."], "307": ["I remember a very pretty German girl who just didn’t smell good."], "330": ["I remember in Boston a portrait of Isabella Gardner by Whistler."], "552": ["I remember cheating at solitaire."], "166": ["I remember how much I tried to like Van Gogh. And how much, finally, I did like him. And how much, now, I can’t stand him."], "102": ["I remember being Santa Claus in a school play."], "173": ["I remember daydreams of dying and how unhappy everybody would be."], "1154": ["I remember that George Washington Carver invented peanut butter."], "1087": ["I remember Buicks with holes in them. (Three or four along each side, I think it was.)"], "236": ["I remember trying to make a new zipper notebook look old."], "3": ["I remember pink dress shirts. And bola ties."], "610": ["I remember how “Penny” in the Sunday comics was always talking on the telephone in unusual positions surrounded by mountains of food."], "1351": ["I remember an ice cream parlor in Tulsa that had a thing called a pig’s dinner.", "It was like a very big banana split in a wooden dish made to look like a pig’s trough.", "If you ate it all they gave you a certificate saying that you ate it all."], "898": ["I remember Jimmy Durante disappearing among spotlighted circles into giant black space."], "722": ["I remember big black galoshes with lots of metal foldover clamps."], "89": ["I remember one very cold and black night on the beach alone with Frank O’Hara. He ran into the ocean naked and it scared me to death."], "975": ["I remember that “bastard” lost a lot of weight with me when I found out what it meant. I had expected something much worse."], "261": ["I remember “I like the colors.”"], "1081": ["I remember juke boxes you could see pick up the records."], "896": ["I remember Agnes Gooch."], "1311": ["I remember the first time I really got drunk.", "I painted my hands and face green with Easter egg dye and spent the night in Pat Padgett’s bathtub. She was Pat Mitchell then."], "955": ["I remember drugstore counter stools with no backs, and swirling around and around on them."], "965": ["I remember pale green walls half way up. And lots of brownish framed prints."], "86": ["I remember a boy who told me a dirty pickle joke. It was the first clue I had as to what sex was all about."], "1193": ["I remember telephone nooks built into walls. And “party lines.”"], "774": ["I remember not finding “The Little King” very funny."], "110": ["I remember my collection of “Modess because . . . ” magazine ads."], "275": ["I remember underwear. (I like underwear.) And socks."], "256": ["I remember “The Bop.”"], "611": ["I remember that Penny’s father always had a pipe in his mouth."], "739": ["I remember “Spam.”"], "218": ["I remember how unsexy swimming naked in gym class was."], "291": ["I remember empty towns. Green tinted windows. And neon signs just as they go off."], "538": ["I remember my mother’s sticking toothpicks into cakes to see if they were done or not."], "1374": ["I remember the first time I met Frank O’Hara. He was walking down Second Avenue.", "It was a cool early Spring evening but he was wearing only a white shirt with the sleeves rolled up to his elbows.", "And blue jeans. And moccasins.", "I remember that he seemed very sissy to me. Very theatrical. Decadent. I remember that I liked him instantly."], "779": ["I remember posture pictures being taken at school and being told that I had really bad posture. And that was that."], "1016": ["I remember, in a very general way, lots of dark green and brown. And, perhaps, a red canoe."], "1227": ["I remember, at the circus, kewpie dolls on sticks smothered in feathers, and how quickly their faces got full of dents."], "1364": ["I remember when I had a job cleaning out an old man’s apartment who had died.", "Among his belongings was a very old photograph of a naked young boy pinned to an old pair of young boy’s underwear.", "For many years he was the choir director at church. He had no family or relatives."], "251": ["I remember seeing colors and designs by closing my eyes very tightly."], "771": ["I remember stories about babies being born in taxi cabs."], "1057": ["I remember, at parties—naked!"], "213": ["I remember that cherries were too expensive."], "483": ["I remember when I was very young a photograph in Life magazine of a man running down the street naked on fire."], "691": ["I remember being a Boy Scout and getting badges in art and fingerprinting and several other easy-to-get badges. First-aid too."], "992": ["I remember, at the end of the sofa, a group of four little pillows that had only one casual arrangement."], "630": ["I remember tight white pants. Certain ways of standing. Blond heads of hair. And spotted bleached blue jeans."], "748": ["I remember little boxes of cereal that opened up in back so you could eat it right out of the box. I remember that sometimes they leaked."], "1230": ["I remember turning around and around real fast until you can’t stand up."], "647": ["I remember having a big crush on Judy and discovering that she was embarrassed to be seen with me so I stopped asking her out."], "664": ["I remember exactly how I visualized the Pilgrims and the Indians having the first Thanksgiving dinner together. (Very jolly!)"], "10": ["I remember when I got a five-year pin for not missing a single morning of Sunday School for five years. (Methodist.)"], "539": ["I remember borrowed punch bowls."], "1226": ["I remember, in dime stores, “bronze” horses in varying sizes from small to quite large, with keychain-like reins."], "35": ["I remember big fat ties with fish on them."], "579": ["I remember the shadows of feet under the cracks of doors. And closeups of doorknobs turning."], "1274": ["I remember miniature hats in miniature hat boxes in a men’s hat store window.", "You got one free when you bought someone a gift certificate for a hat."], "909": ["I remember that Lana Turner wore brown (ugh) to one of her weddings."], "512": ["I remember roller skate keys."], "1324": ["I remember Moley, the local freak and notorious queer. He had a very little head that grew out of his body like a mole.", "No one knew him, but everyone knew who he was. He was always “around.”"], "158": ["I remember Tab Hunter’s famous pajama party."], "617": ["I remember cold cream. “Tums for the tummy.” And Our Miss Brooks."], "234": ["I remember getting erections in school and the bell rings and how handy zipper notebooks were."], "229": ["I remember when Scotch tape wasn’t very transparent."], "342": ["I remember being surprised at how yellow and how red autumn really is."], "874": ["I remember trying to save money, for a day or two, and quickly losing interest."], "1275": ["I remember a man who came around with a pony and a cowboy hat and a camera.", "For so much money he would take your picture on the pony wearing the hat."], "277": ["I remember tight white T-shirts and the gather of wrinkles from under the arms."], "159": ["I remember mammy cookie jars. Tomato soup. Wax fruit. And church keys."], "43": ["I remember Pat Boone and “Love Letters in the Sand.”"], "486": ["I remember daydreams of having a pet monkey that would wear human clothes and we would go around everywhere together."], "346": ["I remember Judy Garland singing “Have Yourself a Merry Little Christmas” (so sad) in Meet Me in St. Louis."], "428": ["I remember a joke about Tom, Dick, and Harry that ended up, “Tom’s dick is hairy.”"], "805": ["I remember The Millionaire on T.V. and how you never got to see his face."], "1022": ["I remember Randy, Katy’s rich blond beau with cars. And K. O., Katy’s poor boxer beau with curly hair and no cars."], "1002": ["I remember, the day after Halloween, talk about car door windows getting soaped, and of lawn furniture appearing on unfamiliar porches."], "863": ["I remember two years of cheating in Spanish class by lightly penciling in the translations of words."], "983": ["I remember, with the one you love, familiar gestures that can drive you up the wall."], "255": ["I remember “The Chicken.”"], "530": ["I remember giant blackheads on little faces in tiny ads in the back of magazines."], "1104": ["I remember speculating that probably someday all races would get mixed up into one race."], "1207": ["I remember wondering how turtles “do it.”"], "976": ["I remember fancy eyeglasses studded with rhinestones."], "268": ["I remember sexual fantasies of seducing young country boys (but old enough): Pale and blond and eager."], "1090": ["I remember souvenir state decals on car rear windows. I remember that some cars had a lot."], "1180": ["I remember rocks you pick up outside that, once inside, you wonder why."], "894": ["I remember talk about flying saucers, before I knew what they were, but never asking."], "980": ["I remember sex on too much grass and the total separation of my head from what’s going on down there."], "565": ["I remember a very big boy named Teddy and what hairy legs his mother had. (Long black ones squashed flat under nylons.)"], "313": ["I remember brown and white shoes with little decorative holes cut out of them."], "329": ["I remember making clover blossom chains."], "52": ["I remember when I lived in Boston reading all of Dostoevsky’s novels one right after the other."], "1141": ["I remember the several rather unusual ways “Pouilly-Fuissé” has come out of my mouth, trying to order a bottle of wine in restaurants."], "627": ["I remember standing up straight in queer bars."], "1285": ["I remember a dark green cement floor covered with wet footprints going in all different directions. Thin white towels.", "And not “looking around” too much."], "589": ["I remember veils over hats over faces sprinkled with little fuzzy dots."], "593": ["I remember roly-poly bugs that curl up into a ball when you touch them."], "243": ["I remember Mantovani and his (100 Strings?)."], "1042": ["I remember Belmondo’s bare ass (a movie “first”) in a terrible “art” movie called, I think, Leda."], "422": ["I remember in gym class during baseball season certain ways of avoiding having to go to bat."], "740": ["I remember when I was very young thinking that shaving looked pretty dangerous."], "302": ["I remember undressing people (in my head) walking down the street."], "447": ["I remember taking an I.Q. test and coming out below average. (I’ve never told anybody that before.)"], "548": ["I remember sexual fantasies of having “to perform” by force."], "790": ["I remember a tower on top of a building in Tulsa that changed colors every few minutes. But only green and yellow and white."], "1071": ["I remember at least once only pretending to make a wish before blowing the candles out."], "351": ["I remember “the Ritz” movie theater. It was full of statues and the ceiling was like a sky at night with twinkling stars."], "568": ["I remember big battle scenes and not understanding how they could be done without a lot of people getting hurt."], "271": ["I remember jerking off to visions of body details."], "954": ["I remember egg salad sandwiches “on white” and large cherry Cokes, at drugstore counters."], "215": ["I remember how many other magazines I had to buy in order to buy one physique magazine."], "265": ["I remember the first time I saw myself in a full-length mirror wearing Bermuda shorts. I never wore them again."], "332": ["I remember that the Van Valkenburgs had more money than we did."], "1175": ["I remember magic carpets and giant “genies” and trying to figure out what my three wishes would be."], "606": ["I remember “just married” cartoons."], "1191": ["I remember the “tornado” way the last of the water has of swirling down the drain so noisily."], "485": ["I remember daydreams of living in an old bus, or an old railroad car, and how I would fix it up."], "28": ["I remember the linoleum floors of my Dayton, Ohio, room. A white puffy floral design on dark red."], "432": ["I remember once having to take a pee sample to the doctor and how yellow and warm it was in a jar."], "1073": ["I remember never going to a birthday party where we played Pin the Tail on the Donkey."], "111": ["I remember my father’s collection of arrow heads."], "990": ["I remember feeling sorry for black people, not because I thought they were persecuted, but because I thought they were ugly."], "326": ["I remember trying to realize how big the world really is."], "1118": ["I remember French bikinis."], "750": ["I remember “blond oak.”"], "207": ["I remember when Negroes had to sit at the back of the bus."], "596": ["I remember in many classrooms a painting of George Washington unfinished at the bottom."], "895": ["I remember two-toned cars. Babysitting for 50¢ an hour. And “I Like Ike.”"], "1312": ["I remember playing doctor with Joyce Vantries. I remember her soft white belly. Her large navel. And her little slit between her legs.", "I remember rubbing my ear against it."], "1330": ["I remember at the end of a haircut getting my neck dusted off with a soft brush full of nice smelling powder.", "And getting swirled around to look in the mirror and how big, afterwards, my ears were."], "1165": ["I remember stealing pieces of candy from previously broken bags on supermarket shelves."], "1314": ["I remember the first art award I ever won. In grade school. It was a painting of a nativity scene. I remember a very large star in the sky.", "It won a blue ribbon at the fair."], "881": ["I remember thinking Brownie uniforms not very pretty: so brown and plain."], "288": ["I remember “lavender past.” (He has a . . . )"], "1360": ["I remember when everything is covered with snow, out the window, first thing in the morning: a really clear surprise.", "It only snowed about twice a year in Tulsa and, as I remember now, usually during the night.", "So, I remember “snow” more than I remember “snowing.”"], "81": ["I remember many Sunday afternoon dinners of fried chicken or pot roast."], "535": ["I remember Oreo chocolate cookies and a big glass of milk."], "152": ["I remember knitted “pants” on drinking glasses."], "1243": ["I remember the rumor that James Dean got off on bodily cigarette burns."], "938": ["I remember corsages with pipe cleaners bent into hearts. With puffs of nets. And long pins with a pearl on the end to pin them on with."], "642": ["I remember what a hard time I had memorizing Shakespeare and how nervous I got when it was my turn to recite."], "1211": ["I remember, in bed in the dark, visions of our house catching fire during the night."], "734": ["I remember one masculine-looking way to hold a cigarette I figured out was to hold it way down between my fingers. Below the knuckles."], "442": ["I remember “hand-me-downs.”"], "244": ["I remember corrugated ribbon that you ran across the blade of a pair of scissors and it curled all up."], "457": ["I remember a picture of Jayne Mansfield sitting in a pink Cadillac with two enormous pink poodles."], "993": ["I remember that no one sat on the sofa (light beige) unless we had company."], "830": [">Tonto, Tonto he no care"], "40": ["I remember canasta."], "188": ["I remember the gasoline station in the snow in The Umbrellas of Cherbourg."], "1161": ["I remember how long a seemingly empty tube of toothpaste can go on and on and on."], "1108": ["I remember “Red Roses for a Blue Lady.” (A blue lady?)"], "601": ["I remember puffed rice shot from guns."], "404": ["I remember “Dixie” drinking cups. And “Bond” bread."], "1014": ["I remember trying to put on a not quite dry bathing suit. (Ugh.)"], "607": ["I remember “stranded on an island in the middle of the ocean” cartoons."], "507": ["I remember little cream jars in restaurants."], "1290": ["I remember bright-colored baby chickens. (Dyed.) They died very fast. Or ran away. Or something.", "I just remember that shortly after Easter they disappeared."], "321": ["I remember Davy Crockett hats. And Davy Crockett just about everything else."], "76": ["I remember shirt collars turned up in back."], "1326": ["I remember taking a test to see which musical instrument I would be best suited for.", "They said it was the clarinet so I got a clarinet and took lessons but I was terrible at it so I stopped."], "669": ["I remember after Halloween my brother and me spreading all our loot out and doing some trading."], "1064": ["I remember a teacher who used to use the word “queer” a lot (meaning “unusual”) and a lot of snickering."], "716": ["I remember a chubby boy whose parents were deaf and dumb. He taught me how to say “Joe” with my hands."], "253": ["I remember bright-colored aluminum drinking glasses."], "56": ["I remember Bickford’s."], "14": ["I remember how much, in high school, I wanted to be handsome and popular."], "1278": ["I remember a woman with not much neck. On her large feet she always wore bright-colored suede platform shoes.", "My mother said they were very expensive."], "612": ["I remember the tobacco smell of my father’s breath."], "732": ["I remember wondering if I looked queer."], "658": ["I remember orange icing on cupcakes at school Halloween parties."], "744": ["I remember a blue glass mirror storefront in Tulsa with one piece missing."], "1126": ["I remember when my arms were always too long for my shirts. Or else the neck was gigantic."], "125": ["I remember being a safety guard and wearing a white strap."], "109": ["I remember my collection of Nova Scotia pamphlets and travel information."], "1359": ["I remember when the word “fairy” began to evoke snickering not knowing why. Then later, I do remember knowing why.", "What I don’t remember is how I learned what it meant.", "Just a gradual process of putting two and two together, I guess. Plus a bit of speculation."], "960": ["I remember two-dollar bills. And silver dollars."], "1121": ["I remember lighting the filter end of a cigarette when you want to appear “cool.”"], "989": ["I remember practicing flexing my jaw muscles, because I thought it looked sexy."], "267": ["I remember sexual fantasies of making it with a stranger in the woods."], "706": ["I remember pink cotton candy and feeling all “sticky” afterwards."], "1347": ["I remember a tall girl with blonde hair who every year got a really dark tan.", "She wore white a lot (to set it off) and light pink “wet” lipstick. Her mother was very tall too. Her father was crippled from polio.", "They had money."], "649": ["I remember thin gold ankle bracelets."], "1208": ["I remember when, walking single file from class to class, getting out of line was pretty serious."], "204": ["I remember a little boy whose father didn’t believe in dancing and mixed swimming."], "616": ["I remember accent pillows. Bathroom decals. Argyle socks. Window valances. And tapioca pudding."], "1178": ["I remember wondering if goats really do eat tin cans."], "966": ["I remember, after school, a period of three or four minutes of lots of locker doors being slammed. And long corridor echoes."], "594": ["I remember those yellow bushes that are the first things to flower in the spring."], "429": ["I remember “sick” jokes."], "573": ["I remember bedroom scenes where the camera goes out the window and down to the ocean to the roar of crashing waves."], "620": ["I remember artist smocks. Liver-shaped palettes. And big black bows."], "411": ["I remember bright orange light coming into rooms in the late afternoon. Horizontally."], "792": ["I remember “bouffants” and “beehives.” (Hairdos.)"], "1172": ["I remember some pretty fuzzy ideas as to what “Ground Hog Day” and “Leap Year” were. Or, for that matter, are."], "18": ["I remember the first time I saw television. Lucille Ball was taking ballet lessons."], "621": ["I remember a pair of brown blue jeans I once had."], "879": ["I remember (in a general sort of way) many nights in bed just holding myself through soft flannel pajamas."], "198": ["I remember cinnamon toothpicks."], "583": ["I remember candy cigarettes like chalk."], "702": ["I remember wax fingernails. Wax moustaches. Wax lips. And wax teeth."], "1048": ["I remember a lot of very rowdy goings-on in Seven Brides for Seven Brothers."], "641": ["I remember the “dum-da-dum-dum-dum” from Dragnet."], "191": ["I remember sitting on top of a horse and how high up it was."], "126": ["I remember “Hazel” in The Saturday Evening Post."], "1127": ["I remember the very thin pages and red edges of hymn books."], "763": ["I remember a girl in junior high school who had a very thin black moustache."], "663": ["I remember “Indian Summer.” And for years not knowing what it meant, except that I figured it had something to do with Indians."], "646": ["I remember Judy."], "186": ["I remember one year in school our principal was Mr. Black and my art teacher was Mrs. Black. (They were not married.)"], "787": ["I remember that once he did."], "555": ["I remember thinking that comic books that weren’t funny shouldn’t be called “comic books.”"], "1287": ["I remember once, when I was very young, seeing my great-grandmother just before she died.", "(But my abstract memory of this only allows me to say “prune.”)"], "1031": ["I remember with fried shrimps in restaurants, not enough tartar sauce."], "1125": ["I remember starched dress shirt collars."], "836": ["I remember clear plastic purses that looked like lunch boxes with a scarf hanging out of them."], "598": ["I remember that carrots are good for your eyes and that beans make you fart."], "1308": ["I remember sex outdoors playing a big part in my fantasies for a while after that. Usually on the beach.", "Except that with one art teacher I had it always in the woods."], "209": ["I remember paper doll twins."], "680": ["I remember seeing every year that movie about “Macy’s” and “Gimbel’s” and the old man who thought he was Santa Claus."], "1045": ["I remember in a musical movie about a fashion designer, a black velvet bat winged suit with a rhinestone cobweb on back."], "1046": ["I remember slightly “sissy” pants on Italian boys in art movies."], "1253": ["I remember smiling at bad news. (I still do sometimes.) I can’t help it. It just comes."], "444": ["I remember earaches. Cotton. And hot oil."], "417": ["I remember stories about what goes on in restaurant kitchens. Like spitting in the soup. And jerking off in the salad."], "219": ["I remember that “Negro men have giant cocks.”"], "917": ["I remember a very tall girl who always had to show her I.D. card to get in for the “under 12” rate."], "4": ["I remember the first drawing I remember doing. It was of a bride with a very long train."], "358": ["I remember big brown radios."], "327": ["I remember trying to figure out what it’s all about. (Life.)"], "295": ["I remember little cows."], "1284": ["I remember in grade school tying a mirror to your shoe and casually slipping it between a girl’s legs during conversation.", "Other boys did that. I didn’t."], "987": ["I remember how difficult it is to let a “public” grin fall gracefully."], "1322": ["I remember when Negroes first started moving into white neighborhoods.", "How everyone got scared because if a Negro moved into your neighborhood the value of your property would go way down."], "300": ["I remember wondering if the person sitting across from me is queer."], "75": ["I remember pony tails."], "149": ["I remember Christmas carols. And car lots."], "949": ["I remember rayon slip-over shirts with knitted bands at the waist."], "1369": ["I remember my parents’ bridge teacher. She was very fat and very butch (cropped hair) and she was a chain smoker.", "She prided herself on the fact that she didn’t have to carry matches around. She lit each new cigarette from the old one.", "She lived in a little house behind a restaurant and lived to be very old."], "529": ["I remember “Korea.”"], "542": ["I remember being embarrassed to blow my nose in public."], "1115": ["I remember little records with big holes (45’s) and being able to carry a whole stack of them between a thumb and a finger."], "1130": ["I remember, when it’s all over, very swirly organ music to exit with."], "755": ["I remember “Chef Boy-ar-dee Spaghetti.”"], "855": ["I remember never using shoehorns."], "1224": ["I remember finding it very mysterious that ballet dancers didn’t break their toes off, doing what they do that way."], "944": ["I remember big black goldfish, and little white paper cartons to carry them home in."], "11": ["I remember when I went to a “come as your favorite person” party as Marilyn Monroe."], "402": ["I remember gray-silver pennies. (Where did they go?)"], "1258": ["I remember when I used to sign my paintings “By Joe.”"], "623": ["I remember a miniature white Bible no bigger than a book of matches."], "1183": ["I remember red hands from falling down on gravel driveways."], "73": ["I remember thin gold chains with one little pearl hanging from them."], "511": ["I remember mackinaws."], "1336": ["I remember Royla Cochran. She lived in an attic and made long skinny people out of wax.", "She was married to a poet with only one arm until he died.", "He died, she said, from a pain in the arm that wasn’t there."], "183": ["I remember dust storms and yellow skies."], "112": ["I remember a 1949 red Ford convertible we once had."], "266": ["I remember Lois Lane. And Della Street."], "950": ["I remember bathroom doors that don’t lock, and trying to pee fast."], "1305": ["I remember “droodles.” (Visual jokes composed of a few simple lines.) The idea being “What is it?”", "(A tomato sandwich.) (Two elephants not on speaking terms.) (Etc.)"], "1100": ["I remember large bars of Ivory soap that broke easily into two. (Actually, now that I think about it, not so easily.)"], "304": ["I remember being hit on the head by bird shit two times."], "525": ["I remember looking for four-leaf clovers, but not for very long."], "872": ["I remember little white fingernail spots."], "1379": ["I remember when Ron Padgett and I first arrived in New York City we told a cab driver to take us to the Village.", "He said, “Where?” And we said, “To the Village.” He said, “But where in the Village?” And we said, “Anywhere.”", "He took us to Sixth Avenue and 8th Street. I was pretty disappointed.", "I thought that the Village would be like a real village. Like my vision of Europe."], "93": ["I remember a boy I once made love with and after it was all over he asked me if I believed in God."], "908": ["I remember pretty women all dressed up in black on witness stands (white hankie in hand) with their legs crossed."], "500": ["I remember that “no two snowflakes are exactly alike.”"], "8": ["I remember how much I cried seeing South Pacific (the movie) three times."], "1101": ["I remember the Dutch Cleanser girl with no face."], "156": ["I remember rick-rack earrings."], "1222": ["I remember, just outside the city limits, firecracker booths."], "72": ["I remember when girls wore cardigan sweaters backwards."], "533": ["I remember rainbows that didn’t live up to my expectations."], "424": ["I remember “Your shirt tail’s on fire!” and then you yank it out and say “Now it’s out!”"], "794": ["I remember school desk carvings and running my ballpoint pen back and forth in them."], "181": ["I remember that life was just as serious then as it is now."], "922": ["I remember when “atheist” was a scary word."], "720": ["I remember, when someone says something that rhymes, “You’re a poet, and didn’t know it, but your feet show it. They’re Longfellows!”"], "1212": ["I remember, in the morning, my eyelashes glued together with “sleep.”"], "1367": ["I remember the olive green velvet lining of my mother’s olive green “leather” jewelry box, with fold-out trays.", "When alone in the house, I loved going through it, examining each piece carefully, trying to pick out my favorites.", "And sometimes, trying on something, but mostly, I just liked to look."], "1345": ["I remember my grandfather who didn’t believe in doctors. He didn’t work because he had a tumor.", "He played cribbage all day. And wrote poems. He had very long ugly toe nails.", "I avoided looking at his feet as much as I could."], "282": ["I remember one very hot summer day I put ice cubes in my aquarium and all the fish died."], "657": ["I remember stamp hinges."], "1263": ["I remember making a cross of two sticks for something my brother and I buried.", "It might have been a cat but I think it was a bug or something."], "967": ["I remember that entering the classroom just as the bell rings is not the same as being in your seat when the bell rings."], "1220": ["I remember red rubber coin purses that opened like a pair of lips, with a squeeze."], "920": ["I remember George and Gracie, and Harry von Zell."], "23": ["I remember a dream I used to have of a lot of a beautiful red and yellow and black snakes in bright green grass."], "846": ["I remember solid red when you close your eyes to the sun."], "16": ["I remember when, in high school, I used to stuff a sock in my underwear."], "423": ["I remember on “free day” in gym class usually picking stilts."], "1213": ["I remember trying to conjure up visions in my head of a physical god without very much luck other than “very old” and “very white.”"], "1341": ["I remember having a friend overnight, and lots of giggling after the lights are out.", "And seemingly long silences followed by “Are you asleep yet?” and, sometimes, some pretty serious discussions about God and Life."], "934": ["I remember a somehow slightly strange Christian Science Reading Room."], "810": ["I remember “panty raids.”"], "885": ["I remember (visually) socks on the floor, tossed after a day of wear. They always look so comfortable there."], "1092": ["I remember old ladies’ houses with a lot of things to break in them."], "921": ["I remember (z - z - z) “The Kingston Trio.”"], "831": [">Lone Ranger buy him ’nother pair.”"], "258": ["I remember “I like to be able to tell what things are.”"], "331": ["I remember winning a Peter Pan Coloring Contest and getting a free pass to the movies for a year."], "760": ["I remember a photograph in Life magazine of a woman jumping off a building."], "1269": ["I remember one morning the milkman handed me a camera. I never did understand exactly why.", "I’m sure it had something to do with a contest, though."], "592": ["I remember houseshoes that were just leather soles sewn to the bottoms of a pair of socks."], "1051": ["I remember being shown to my seat with a flashlight."], "1299": ["I remember “Le Metro.” (A coffeehouse on Second Avenue that had poetry readings.) Paul Blackburn.", "And Diane di Prima sitting on top of a piano reading her poems."], "781": ["I remember prophylactic machines in gas station bathrooms."], "651": ["I remember nylon “runs.”"], "364": ["I remember one brick wall and three white walls."], "341": ["I remember pillow fights."], "1040": ["I remember wooden forks hard to handle a big potato salad lump with."], "1236": ["I remember “spin the bottle” and “post office.”"], "118": ["I remember the outhouse and a Sears and Roebuck catalog to wipe off with."], "803": ["I remember the first time I ate beefsteak tartare eating lots of crackers and butter with it."], "493": ["I remember thin flat sheets of apricot candy in delicatessen windows."], "626": ["I remember leaning up against walls in queer bars."], "263": ["I remember “It’s interesting.”"], "349": ["I remember Christmas cards arriving from people my parents forgot to send Christmas cards to."], "292": ["I remember (I think) lavender-tinted windows on one bus."], "981": ["I remember, after a lot of necking, how untheatrical the act of getting undressed can sometimes be."], "1056": ["I remember, in crowds—total isolation!"], "471": ["I remember that girls who worked in the school cafeteria had to wear hairnets."], "640": ["I remember “A white sports coat and a pink carnation.”"], "871": ["I remember peeing underwater in my bathing suit once, and how sexy and warm it felt."], "852": ["I remember when a piece of hair stands up straight after a night of sleeping on it wrong."], "88": ["I remember when I thought that if you did anything bad, policemen would put you in jail."], "490": ["I remember Second Avenue and strawberry shortcake at “Ratner’s.”"], "1210": ["I remember diagramming sentences. And arithmetic cards, more than I remember arithmetic."], "729": ["I remember daydreams of going blind and how sorry everyone would feel for me."], "1049": ["I remember Jane Russell and a lot of muscle men doing a big number around the swimming pool of a luxury liner."], "278": ["I remember a not very pleasant sexual dream involving Kenward Elmslie’s dog Whippoorwill."], "373": ["I remember the first escalator in Tulsa. In a bank. I remember riding up and down it. And up and down it."], "996": ["I remember (ugh) white nurse shoes."], "94": ["I remember when I thought that anything old was very valuable."], "1366": ["I remember the Millers who lived next door. Mrs. Miller was an Indian and Mr. Miller was a radio ham.", "They had five children and a very little house. There was always junk all over their yard. And inside the house too.", "Their living room was completely taken up by a big green ping pong table."], "624": ["I remember finding the story of Noah and his ark really just too far out."], "63": ["I remember my collection of ceramic monkeys."], "1096": ["I remember boat steering wheel wall lamps."], "1325": ["I remember sexual fantasies of old faded worn and torn blue jeans and the small areas of flesh revealed.", "I especially remember torn back pockets with a triangle of soft white bottom showing."], "287": ["I remember peach-colored evenings just before dark."], "379": ["I remember how disappointing going to bed with one of the most beautiful boys I have ever seen was."], "820": ["I remember “Monopoly” and “Clue.”"], "882": ["I remember daydreams of going through old trunks in attics, and finding fantastic things."], "1009": ["I remember (from lake life) mosquitoes."], "388": ["I remember paying a dime and getting a red paper poppy made by people in wheelchairs."], "670": ["I remember always at the bottom of the bag lots of dirty pieces of candy corn."], "864": ["I remember No. 2 yellow pencils with pink erasers."], "1327": ["I remember a big black rubber thing going over my mouth and nose just before I had my tonsils taken out.", "After my tonsils were taken out I remember how my throat felt eating vanilla ice cream."], "696": ["I remember a boy who could pull the undersides of his eyelids down over his eyeballs."], "584": ["I remember finding things in glove compartments I had looked for there before and not found."], "838": ["I remember neckties that were already tied with elastic to go around your neck."], "452": ["I remember that I put everything else on before I put my socks on."], "64": ["I remember my brother’s collection of ceramic horses."], "1283": ["I remember when hoody boys wore their blue jeans so low that the principal had to put a limit on that too.", "I believe it was three inches below the navel."], "71": ["I remember the clock from three to three-thirty."], "1010": ["I remember mosquito spray. Mosquito bites. And mosquito bite medicine."], "1250": ["I remember (night) desperate (to say nothing of fruitless) flips through my address book."], "363": ["I remember candles in wine bottles."], "164": ["I remember chalk."], "603": ["I remember an ashtray that looked like a house and when you put your cigarette down (through the door) the smoke came out of the chimney."], "742": ["I remember “Kraft’s” sandwich spread."], "942": ["I remember goldfish tanks in dime stores. And nylon nets to catch them with."], "1288": ["I remember having to pull down my pants once to show the doctor my dick. It was all red and swollen. A solid mass of chigger bites.", "(Pretty embarrassing.)"], "371": ["I remember after people are gone thinking of things I should have said but didn’t."], "1256": ["I remember not being able to pronounce “mirror.”"], "1214": ["I remember “being all alone with J. J. Mitchell at a ski lodge out-of-season” fantasies, which worked out just fine."], "1303": ["I remember seeing an old lady pee in a subway car recently and it wasn’t shocking at all, I’m sorry to say.", "One does learn to draw blanks: a compliment to nothing."], "925": ["I remember a brief period of “bad breath” concern: the product of a health class at school."], "982": ["I remember, in the heart of passion once, trying to get a guy’s turtle-neck sweater off. But it turned out not to be a turtle-neck sweater."], "575": ["I remember that Rock Hudson and Charlie Chaplin and Lyndon Johnson have “giant cocks.”"], "1329": ["I remember when one year in Tulsa by some freak of nature we were invaded by millions of grasshoppers for about three or four days.", "I remember, downtown, whole sidewalk areas of solid grasshoppers."], "7": ["I remember the only time I ever saw my mother cry. I was eating apricot pie."], "12": ["I remember one of the first things I remember. An icebox. (As opposed to a refrigerator.)"], "115": ["I remember trying to visualize my mother and father actually fucking."], "1209": ["I remember pencil boxes with a little ruler and a little compass in a little drawer."], "952": ["I remember the disappointments of picking up a developed roll of film at the drugstore."], "946": ["I remember wondering if female cum is called “cum” too."], "370": ["I remember doing other things with straws besides drinking through them."], "1293": ["I remember stories about how people did it all the time in public swimming pools.", "(Which I rarely got to go to because of the possibility of catching polio.)"], "418": ["I remember that Lana Turner was discovered sipping a soda in a drugstore."], "737": ["I remember hating myself after group gatherings for being such a bore."], "1027": ["I remember sudden fantasy flashes of how many people all over the world are fucking “at this very moment.”"], "145": ["I remember bacon and lettuce and tomato sandwiches and iced tea in the summertime."], "1196": ["I remember picture windows with not much view except other picture windows."], "1079": ["I remember teenagers riding around in convertibles with their radios on loud."], "100": ["I remember when I worked for a department store doing fashion drawings for newspaper ads."], "597": ["I remember okra, hominy grits, liver, and spinach."], "574": ["I remember Jane Russell’s hair all pulled over to one side and flat as a rock on top."], "1124": ["I remember a lot of giggling and note-passing in the balcony at church."], "772": ["I remember the little appliqued diver on all Jantzen swimsuits."], "710": ["I remember finger painting and usually ending up with a sort of purple-brown mess."], "892": ["I remember “Uranium.”"], "1315": ["I remember the first time I got jerked off (never did discover it for myself).", "I didn’t know what she was trying to do and so I just laid there like a zombie not helping one bit."], "459": ["I remember (I think) a candy bar called “Big Dick.”"], "175": ["I remember daydreams of being a dancer and being able to leap higher than anyone thought was humanly possible."], "464": ["I remember someone telling me that if you farted on a lit match it would make a big blue flame."], "1003": ["I remember a girl who could bend her thumb all the way back. And a boy who could wiggle one ear at a time."], "176": ["I remember driving in cars and doing landscape paintings in my head. (I still do that.)"], "1348": ["I remember a store we had where we bought stuff at the five and ten and then re-sold the stuff for a penny or two more than it cost.", "And then with the money we bought more stuff. Etc. We ended up by making several dollars clear."], "945": ["I remember the rumor that Mae West keeps her youthful appearance by washing her face in male cum."], "1019": ["I remember black tongues from eating licorice."], "1344": ["I remember Bunny Van Valkenburg. She had a little nose. A low hairline. And two big front teeth.", "She was my girlfriend for several years when we were very young. Later on, in high school, she turned into quite a sex-pot."], "138": ["I remember driftwood lamps."], "1036": ["I remember black marshmallows, and inside, a flood of warm white."], "889": ["I remember a lot of fuss about The Catcher in the Rye."], "633": ["I remember pretty faces that don’t move."], "699": ["I remember peeing all over J. J. Mitchell in a dream once."], "1116": ["I remember little yellow and red and green plastic children’s records."], "1107": ["I remember no way to scratch your ear in the dentist chair when your ear itches."], "1159": ["I remember making a three-dimensional map of the United States with oatmeal and paste."], "232": ["I remember shaking big hands."], "357": ["I remember the “T-zone.” (Camel cigarettes.)"], "506": ["I remember hayrides and slumber parties."], "508": ["I remember “statues.” (A game where someone swung you around and then let go and you froze in whatever position you landed.)"], "55": ["I remember planning to tear page 48 out of every book I read from the Boston Public Library, but soon losing interest."], "1013": ["I remember cold mud between your toes, under warm brown water."], "250": ["I remember visions (when in bed but not asleep yet) of very big objects becoming very small and of very small objects becoming very big."], "46": ["I remember “Sixteen Tons.”"], "873": ["I remember biting on a little piece of flesh inside my mouth until a very sweet sort of pain came."], "170": ["I remember living rooms all one color."], "22": ["I remember many dreams of finding gold and jewels."], "802": ["I remember when turtle necks were big, talk about what restaurants would let you in and what ones wouldn’t."], "344": ["I remember Peter Pan collars."], "759": ["I remember two-piece bathing suits. Alphabet soup. Ozzie and Harriet. And pictures of kidney-shaped swimming pools."], "37": ["I remember rainbow pads."], "769": ["I remember in many comic books a full-page ad packed solid with rings. I remember especially one skull ring I always wanted."], "839": ["I remember “bunny hops.” “Picture hats.” And toilet paper and chicken wire floats."], "1320": ["I remember Bunny Van Valkenburg’s mother Betty. She was short and dumpy and bubbly and she wore giant earrings.", "Once she wallpapered her kitchen floor with wallpaper. Then shellacked it."], "911": ["I remember mean prison wardens."], "450": ["I remember locker rooms. And locker room smells."], "443": ["I remember pig-latin."], "618": ["I remember book ends. Arm chairs. And end tables."], "290": ["I remember wondering what the bus driver is thinking about."], "489": ["I remember living on the Lower East Side."], "1037": ["I remember that mustard and bottle openers were the traditional things to forget. But I don’t remember either ever being forgotten."], "801": ["I remember Nehru jackets."], "220": ["I remember that “Chinese men have little cocks.”"], "430": ["I remember Mary Anne jokes."], "1070": ["I remember pink and brown and white ice cream in layers."], "768": ["I remember a series of Cadillac ads with beautiful diamond and ruby and emerald necklaces, according to the color of the car in the ad."], "536": ["I remember vanilla pudding with vanilla wafers in it and sliced bananas on top."], "273": ["I remember underarms where the flesh is softer and whiter."], "284": ["I remember a big black cat named Midnight who got so old and grouchy that my parents had him put to sleep."], "795": ["I remember noisy candy wrappers when you don’t want to make any noise."], "588": ["I remember a tin clown bank that stuck his tongue out and a monkey bank that tipped his hat."], "916": ["I remember the Gomer Pyle-Rock Hudson affair rumor."], "537": ["I remember angel food cake and wondering why the hole in the middle had to be there."], "214": ["I remember a drunk man in a tuxedo in a bar who wanted Ron Padgett and me to go home with him but we said no and he gave us all his money."], "919": ["I remember 21-inch television screens!"], "479": ["I remember the smell (loved it) of fingernail polish."], "1333": ["I remember white margarine in a plastic bag. And a little package of orange powder.", "You put the orange powder in the bag with the margarine and you squeezed it all around until the margarine became yellow."], "497": ["I remember going grocery shopping with Pat Padgett (Pat Mitchell then) and slipping a steak into her coat pocket when she wasn’t looking."], "212": ["I remember dark red fingernail polish almost black."], "1142": ["I remember (too much wine) trying to leave a restaurant gracefully. Which is to say, in a series of relatively straight lines."], "715": ["I remember fire drills. And air-raid drills."], "458": ["I remember how long Oscar Levant’s piano numbers were."], "299": ["I remember donuts and coffee. Stools. Pasted-over prices. And gray people."], "897": ["I remember on newsstands, Jet magazine. But never getting up the courage to thumb through a copy."], "1323": ["I remember that shaking or holding hands with a girl while you scratched her palm with your middle finger was somehow “dirty.”", "(Often done as a joke and the girl would turn red and scream.)"], "206": ["I remember when the Pepsi-Cola Company was on its last leg."], "362": ["I remember bongo drums."], "832": ["I remember a bust of Benjamin Franklin on a cover of The Saturday Evening Post once every year."], "714": ["I remember that a lot of kissing went on in the drinking fountain area."], "119": ["I remember animal smells and very cold water on your face in the morning."], "541": ["I remember braces (on teeth) and how, at a certain point in high school it was almost a status symbol."], "1244": ["I remember awkward elevator “moments.”"], "859": ["I remember the way cranberry sauce slides out of the can, and then plops."], "184": ["I remember rainy days through a window."], "558": ["I remember trying to imagine what I’d look like as an old man."], "19": ["I remember the day John Kennedy was shot."], "116": ["I remember a cartoon of a painter painting from a naked model (back view) and on his canvas was a picture of a Parker House roll."], "1317": ["I remember Frank O’Hara’s walk. Light and sassy. With a slight bounce and a slight twist. It was a beautiful walk. Confident.", "“I don’t care” and sometimes “I know you are looking.”"], "391": ["I remember a story about my mother finding a rat walking all over my brother’s face while he was sleeping. Before I was born."], "1356": ["I remember Bunny Van Valkenburg’s father Doc. He was our family doctor.", "I remember him telling of a patient he had who got poison ivy inside his body.", "The man was in total misery but it healed very fast because there was no way that he could scratch it."], "933": ["I remember “If you step on a crack, you break your mother’s back.”"], "1158": ["I remember keeping a list of states visited."], "825": ["I remember father and son dinners."], "412": ["I remember the $64,000 Question scandal."], "968": ["I remember big yellow mums, arranged with autumn leaves, in flower shop windows."], "930": ["I remember sneezing into my hand, out in public, and then the problem of what to “do” with it."], "441": ["I remember an old royal blue taffeta formal my little sister had for playing dress-up in and I remember dressing up in it."], "521": ["I remember daydreams of having supernatural powers and amazing people with my accurate predictions."], "1029": ["I remember poetry reading fantasies of having everyone in tears. (Good tears.)"], "721": ["I remember yellow rubber raincoats with matching hoods."], "151": ["I remember rummage sales. Ice cream socials. White gravy. And Hopalong Cassidy."], "985": ["I remember finding things in that drawer I wasn’t supposed to see, smothered in nylons."], "906": ["I remember that Rock Hudson “is still waiting for the right girl to come along.”"], "354": ["I remember ballerina figurines from Japan with real net-like tutus."], "784": ["I remember a long brown leather strap. Beat-up magazines. And kids who cried. (And then got suckers.)"], "44": ["I remember Teresa Brewer and “I Don’t Want No Ricochet Romance.”"], "200": ["I remember pastel-colored rocks that grew in water."], "684": ["I remember very clearly (visually) a bride doll sitting in a red wagon under the Christmas tree when I was very young. (For me.)"], "1197": ["I remember the rather severe angles of “Oriental” lamp shades."], "1229": ["I remember dangerous BB gun stories about kids losing eyeballs."], "1106": ["I remember “a pot of gold at the end of the rainbow.”"], "553": ["I remember sometimes letting people win games."], "1385": ["I remember when I got drafted and had to go way downtown to take my physical. It was early in the morning.", "I had an egg for breakfast and I could feel it sitting there in my stomach.", "After roll call a man looked at me and ordered me to a different line than most of the boys were lined up at.", "(I had very long hair which was more unusual then than it is now.)", "The line I was sent to turned out to be the line to see the head doctor. (I was going to ask to see him anyway.)", "The doctor asked me if I was queer and I said yes. Then he asked me what homosexual experiences I had had and I said none.", "(It was the truth.) And he believed me. I didn’t even have to take my clothes off."], "481": ["I remember the first time I heard water swishing around in my stomach (while running) and thinking that maybe I had a tumor."], "1089": ["I remember noisy exhaust pipes."], "674": ["I remember the dangers of angel hair."], "1184": ["I remember searching for something you know is there, but it isn’t."], "132": ["I remember “Suave” hair cream. (Pale peach.)"], "591": ["I remember “Aspergum.” And muumuus. And making Easter baskets out of “Quaker” oatmeal boxes at school."], "971": ["I remember the legs of a certain teacher when, every now and then, she revealed nylons rolled down to just below her knees."], "1272": ["I remember St. Louis when I was very young.", "I remember the tattoo shop next to the bus station and the two big lions in front of the Museum of Art."], "211": ["I remember drinking glasses with girls on them wearing bathing suits but when you filled them up they were naked."], "1105": ["I remember (to be more accurate) feeling cheap about it because I didn’t feel cheap about it."], "147": ["I remember salt on watermelon."], "972": ["I remember senior class rings on chains around necks."], "1372": ["I remember a middle-aged lady who ran an antique shop in the Village.", "She asked me to come over and fix her bathroom late at night but she wouldn’t say what was wrong with it.", "I said yes because saying no has always been difficult for me. But the night I was to go I just didn’t go.", "The antique shop isn’t there anymore."], "1052": ["I remember dancing boxes of popcorn and hot dogs singing, “Let’s all go out to the lobby, and get ourselves a treat!”"], "413": ["I remember that woman who was always opening refrigerators."], "571": ["I remember bedroom scenes that focused mostly on the wallpaper."], "435": ["I remember a red velvet swing in a movie called The Red Velvet Swing."], "1273": ["I remember giving myself two or three wishes and trying to figure out what they would be.", "(Like a million dollars, no more polio, and world peace.)"], "78": ["I remember duck-tails."], "1084": ["I remember “necking.”"], "97": ["I remember when I thought that I was a great artist."], "523": ["I remember raccoon tails hanging from car antennas."], "1352": ["I remember getting up at a certain hour every morning to walk down the street to pass a certain boy on his way to work.", "One morning I finally said hello to him and from then on we always said hello to each other. But that was as far as it went."], "400": ["I remember wondering if my older brother is queer too."], "1255": ["I remember changing my name to Bo Jainard for about one week."], "582": ["I remember jungle plants that eat people."], "842": ["I remember in souvenir shops miniature wishing wells of highly shellacked orangey colored wood. And miniature out-houses too."], "473": ["I remember chicken noodle soup when you are sick."], "27": ["I remember throwing my eyeglasses into the ocean off the Staten Island ferry one black night in a fit of drama and depression."], "1228": ["I remember “pick-up sticks,” “tiddly-winks,” “fifty-two pickup,” and “war.”"], "997": ["I remember trying to visualize “the travels” of shit, after you flush the toilet."], "226": ["I remember very thin belts."], "824": ["I remember mother and daughter dresses."], "689": ["I remember rolling balls of mercury around in the palm of my hand, and shining dimes with it."], "915": ["I remember the Marilyn Monroe-John Kennedy affair rumor."], "534": ["I remember big puzzles on card tables that never got finished."], "386": ["I remember pouring out a glass of water (I was a fountain) in a front porch musical production of “Strolling through the Park One Day.”"], "780": ["I remember fire insurance ads of homeless families all wrapped up in blankets."], "58": ["I remember a red car coat."], "407": ["I remember blonde women who get so much sun you can’t see them."], "758": ["I remember cold cream on my mother’s face."], "322": ["I remember not understanding why people on the other side of the world didn’t fall off."], "688": ["I remember loving raw biscuit dough."], "913": ["I remember the “casting couch.”"], "505": ["I remember making angel impressions in the snow by falling backwards and flapping my arms up and down and my legs back and forth."], "671": ["I remember the smell (not very good) of burning pumpkin meat inside jack-o’-lanterns."], "935": ["I remember hide-and-seek, and peeking while counting to a hundred."], "951": ["I remember, when you’ve done a real stinker, hoping there won’t be someone waiting to rush in right after you."], "1061": ["I remember, just out of bed in the morning, red wrinkle designs on your skin."], "936": ["I remember finding the thought of being an albino somehow more mysterious than just “no color pigment.”"], "910": ["I remember in very scary movies, and in very sad movies, having to keep reminding myself that “it’s only a movie.”"], "369": ["I remember toreador pants."], "1075": ["I remember Cream of Wheat lumps."], "723": ["I remember a very deluxe Crayola set that had gold and silver and copper."], "360": ["I remember fishnet."], "817": ["I remember at junior high school dances mostly just girls dancing with girls."], "1291": ["I remember not very hard Easter egg hunts. And the ones that didn’t get eaten soon enough got all gray-green inside.", "(To say nothing of smelling like shit!)"], "1217": ["I remember the still mysterious to me association of western music with greasy eggs in a diner on a Sunday morning."], "1129": ["I remember when all heads are bowed in prayer, looking around a lot."], "602": ["I remember “Snap, crackle, and pop.”"], "368": ["I remember Dorothy Kilgallen’s face."], "397": ["I remember trying to devise something with a wet sponge in a glass to jerk off into but it didn’t quite work out."], "1137": ["I remember, when one stops before the other, a moment of “fake” silence."], "560": ["I remember “no ankles” on some old ladies."], "856": ["I remember not finding pumpkin pie very visually appealing."], "1021": ["I remember Katy Keene. And a pair of candy cane eyeglasses her little sister “Sis” had."], "1286": ["I remember Popsicle coupons. Ballerina paper dolls.", "And carnival glass piggy banks with no way to get the money out except by shaking it out upside down."], "822": ["I remember getting all dressed up to go buy clothes."], "82": ["I remember my first oil painting. It was of a chartreuse green field of grass with a little Italian village far away."], "203": ["I remember pearlized plastic toilet seats."], "1384": ["I remember “the cat lady” who always wore black. And many pairs of nylons. One on top of the other on top of the other.", "She was called “the cat lady” because every night she went around feeding cats.", "Her hair was so matted I don’t think a comb could possibly have gone through it.", "All day long she roamed the streets doing what I am not sure.", "She was never without her shopping cart full of paper bags full of God only knows what.", "According to her there were other cat ladies who looked after cats in other Lower East Side areas.", "How organized all these ladies were I don’t know."], "113": ["I remember The Power of Positive Thinking by Norman Vincent Peale."], "815": ["I remember picture card machines at the fair of movie stars and pin-up girls and cowboys."], "703": ["I remember that George Washington’s teeth were made of wood."], "712": ["I remember one girl who sometimes didn’t wear panties."], "1386": ["I remember a boy who worked for an undertaker after school. He was a very good tap dancer.", "He invited me to spend the night with him one day. His mother was divorced and somewhat of a cheap blond in appearance.", "I remember that his mother caught us innocently wrestling out in the yard and she got very mad. She told him never to do that again.", "I realized that something was going on that I knew nothing about. We were ten or eleven years old. I was never invited back.", "Years later, in high school, he caused a big scandal when a love letter he had written to another boy was found.", "He then quit school and worked full time for the undertaker.", "One day I ran into him on the street and he started telling me about a big room with lots of beds where all the undertaker employees slept.", "He said that each bed had a little white tent in the morning. I excused myself and said goodbye.", "Several hours later I figured out what he had meant. Early morning erections."], "498": ["I remember Leadbelly records smaller than most records."], "405": ["I remember the “Breck” shampoo ladies."], "1054": ["I remember finding myself in situations I all of a sudden feel (remember) I’ve been in before: a “repeat” life flash."], "1171": ["I remember the chocolate Easter bunny problem of where to start."], "551": ["I remember stories about nuns and candles and throwing babies into the basement furnace."], "866": ["I remember the rotating system of seating where, every Monday, you moved up a seat."], "681": ["I remember, after Christmas caroling, hot chocolate."], "130": ["I remember Dr. Pepper. And Royal Crown Cola."], "577": ["I remember the rumor that Marlon Brando liked Oriental women so much because he had a little cock."], "463": ["I remember trying to imagine certain people going to the bathroom."], "837": ["I remember a pink hairnet my mother had with larger than usual openings."], "515": ["I remember “Sticks and stones may break my bones but words will never hurt me.”"], "1215": ["I remember in the morning (real life) “hickies.”"], "957": ["I remember when going to an analyst meant (to me) that you were real sick."], "434": ["I remember the little boy with the very deep voice in Gentlemen Prefer Blondes. (Like a frog.)"], "101": ["I remember four Alice Esty concerts."], "1140": ["I remember trying not to look lonely in restaurants alone."], "1370": ["I remember Bettina Beer. (A girl.) We used to go to dances together.", "I bet she was a dyke, though it never would have occurred to me at the time. She cussed a lot.", "And she drank and smoked with her mother’s approval. She didn’t have a father.", "She wore heavy blue eye shadow and she had white spots on her arms."], "1179": ["I remember the fear of “horror” coming out of my mouth as “whore,” as indeed it quite often did."], "41": ["I remember “How Much Is That Doggie in the Window?”"], "343": ["I remember chain letters."], "1024": ["I remember costume dolls with their skirts up in back in square boxes with cellophane “window” fronts."], "566": ["I remember Dagwood and Blondie shorts before the feature started."], "70": ["I remember many first days of school. And that empty feeling."], "314": ["I remember certain group gatherings that are hard to get up and leave from."], "1337": ["I remember thinking once that flushing away pee might be a big waste.", "I remember thinking that pee is probably good for something and that if one could just discover what it was good for one could make a mint."], "5": ["I remember my first cigarette. It was a Kent. Up on a hill. In Tulsa, Oklahoma. With Ron Padgett."], "1331": ["I remember a very chewy kind of candy sold mostly at movie theatres. (Chocolate covered caramel pieces of candy in a yellow box.)", "They stuck to your teeth. So chewy one box would last for a whole movie."], "827": ["I remember:"], "544": ["I remember, when traveling, laying tissue paper over the toilet seat rim because “You never know.”"], "1015": ["I remember, inside swimming trunks, white draw strings."], "106": ["I remember a very poor boy who had to wear his sister’s blouses to school."], "69": ["I remember those bright-colored nylon seersucker shirts that you could see through."], "440": ["I remember square dancing and “The Texas Star.”"], "1086": ["I remember “stripped” cars. (No chrome.)"], "395": ["I remember “Revlon.” And that ex-Miss America lady."], "242": ["I remember not looking at crippled people."], "39": ["I remember the day Frank O’Hara died. I tried to do a painting somehow especially for him. (Especially good.) And it turned out awful."], "1181": ["I remember hearing once about a boy who found a dead fly in his Coke and so the Coca-Cola Company gave him a free case of Cokes."], "1152": ["I remember “Last one to the corner’s a rotten egg!”"], "1173": ["I remember thinking that “S.O.S.” meant something dirty."], "1023": ["I remember secretly feeling that she would someday end up with K. O."], "1262": ["I remember a job I once had sketching portraits of people at a coffeehouse. Table to table. During folk singing intermissions.", "By candlelight."], "845": ["I remember, sitting out in the out-house, visions of what it would be like to fall in."], "545": ["I remember “number one” and “number two.”"], "749": ["I remember cedar chests. (And the smell of.)"], "1298": ["I remember trying to convince Ron Padgett that I didn’t believe in God anymore but he wouldn’t believe me. We were in the back of a truck.", "I don’t remember why."], "660": ["I remember walking home from school through the leaves alongside the curb."], "385": ["I remember “that” feeling, cleaning out your navel."], "1268": ["I remember that for my fifth birthday all I wanted was an off-one-shoulder black satin evening gown.", "I got it. And I wore it to my birthday party."], "586": ["I remember bar stools and kitchen nooks and brass ivy planters."], "978": ["I remember a “white trash” boy with an enormously tall crew cut long after crew cuts were in."], "105": ["I remember Miss Fly, my grade school science teacher."], "298": ["I remember that I can never remember how bathroom doors in buses open."], "956": ["I remember when the floor seemed a long way down."], "677": ["I remember after Christmas shopping coming home and gloating over everything I bought."], "1174": ["I remember fantasies of finding notes in old bottles washed ashore."], "474": ["I remember that a good way to catch a cold is to walk around barefooted. To not get enough sleep. And to go outside with wet hair."], "1328": ["I remember in Tulsa my first one-man show of brush and ink drawings of old-fashioned children.", "They were so intricate and fine that nobody could believe that I did them with a brush. But I did."], "1292": ["I remember Delancey Street. The Brooklyn Bridge. Orchard Street. The Staten Island Ferry.", "And walking around the Wall Street area late at night. (No people.)"], "143": ["I remember Pug and George and their only daughter Norma Jean who was very beautiful and died of cancer."], "367": ["I remember putting on sun tan oil and having the sun go away."], "185": ["I remember salt shakers at the school cafeteria when the tops had been unscrewed."], "470": ["I remember light green notebook paper. (Better for your eyes than white.)"], "1007": ["I remember enormous dictionaries."], "32": ["I remember pill box hats."], "286": ["I remember wishing I knew then what I know now."], "1282": ["I remember fantasizing about being a super-stud and being able to shoot enormous loads.", "And (would you believe it?) (yes, you’ll believe it) I still do."], "600": ["I remember “An apple a day keeps the doctor away.”"], "1139": ["I remember (in color) very pink skin and very orange skin."], "283": ["I remember dreams of walking down the street and suddenly realizing that I have no clothes on."], "1034": ["I remember greeting cards with, somewhere on them, a real feather."], "585": ["I remember screen doors that slam. And “You’re letting in the flies.”"], "1035": ["I remember picnics."], "139": ["I remember reading once about a lady who choked to death eating a piece of steak."], "1232": ["I remember crocheted dress-up gloves with only half fingers."], "833": ["I remember “a ham” every year for Christmas from the company my father worked for."], "15": ["I remember when, in high school, if you wore green and yellow on Thursday it meant that you were queer."], "504": ["I remember snow, making snow-creams, and never having much luck making snowmen."], "165": ["I remember when green blackboards were new."], "431": ["I remember “Mommy, Mommy, I don’t like my little brother.” “Shut up, Mary Anne, and eat what I tell you to!” (That’s a Mary Anne joke.)"], "984": ["I remember a small top drawer full of nylons, and my mother, in a rush, trying to find two that matched."], "615": ["I remember plaster of paris figurines you made in red rubber molds and then you painted them."], "1245": ["I remember when both arms of your theater seat have elbows on them."], "927": ["I remember that germs are everywhere!"], "1201": ["I remember “good dishes” versus “everyday dishes.”"], "208": ["I remember pink lemonade."], "853": ["I remember before green dishwashing liquid."], "1371": ["I remember George Evelyn who had a red and white face because of an explosion he was in once.", "And his wife Jane who wore green a lot and laughed very loud. I remember their only son George Junior who was my age.", "He was very fat and very wild. But I hear that he settled down, got married, and is active in church."], "238": ["I remember thinking that my mother and father were ugly naked."], "240": ["I remember jeweled sweaters with fur collars open to the waist."], "1138": ["I remember “muscle magazines” nothing to do with building muscles."], "0": ["I Remember"], "1239": ["I remember the way a baby’s hand has of folding itself around your finger, as though forever."], "1004": ["I remember a lady almost talking my mother into a set of encyclopedias."], "190": ["I remember waking up somewhere once and there was a horse staring me in the face."], "888": ["I remember reading the big sex scene on the beach in Peyton Place."], "1383": ["I remember a story my mother telling of an old lady who had a china cabinet filled with beautiful antique china and stuff.", "One day a tornado came and knocked the cabinet over and to the floor but nothing in it got broken.", "Many years later she died and in her will she left my father a milk glass candy dish in the shape of a fish.", "(It had been in the cabinet.) At any rate, when the candy dish arrived it was all broken into many pieces.", "But my father glued it back together again."], "1353": ["I remember (on the other hand) fantasies of being in jail, and of good raw sex. All very “black and white” somehow.", "Black bars, white tiles. White flesh, black hairs. The rubbery warm whites of cum, and the shiny cold blacks of leather and slate."], "998": ["I remember, when someone is standing next to you in a public latrine, how long it can seem before you get “started.”"], "563": ["I remember a boy who could curl up his lips (“nigger lips”) and hold them there."], "421": ["I remember drinking fountains that start out real low and when you put your face down they spurt way up into your nose."], "1368": ["I remember daydreams of a doctor who (on the sly) was experimenting with a drug that would turn you into a real stud.", "All very “hush-hush.” (As it was illegal.)", "There was a slight chance that something might go wrong and that I’d end up with a really giant cock, but I was willing to take that chance."], "382": ["I remember dingle berries."], "783": ["I remember a short dumpy girl with long hair and pierced ears and giant tits that was supposed to be an easy lay."], "943": ["I remember ceramic castles. Mermaids. Japanese bridges. And round glass bowls of varying sizes."], "826": ["I remember the Lone Ranger and Tonto."], "197": ["I remember people who went to church only on Easter and Christmas."], "884": ["I remember white socks with a thin red and blue stripe at the top."], "174": ["I remember daydreams of committing suicide and of the letter I would leave behind."], "886": ["I remember fantasies of being in jail, and very monk-like in my cell, hand-writing out a giant great novel."], "974": ["I remember the “fuck you” finger."], "325": ["I remember “Love Me Tender.”"], "876": ["I remember, on cold mornings, counting to ten before making myself jump out of bed."], "1038": ["I remember laying something across the napkins so they won’t blow away."], "648": ["I remember Bill Haley and “Rock around the Clock.”"], "1189": ["I remember taking baths with my brother Jim when we were very young, back to back."], "918": ["I remember blonde furniture."], "25": ["I remember playing “doctor” in the closet."], "1192": ["I remember stories about people getting electrocuted by talking on the telephone in the bathtub."], "491": ["I remember the St. Mark’s movie theatre (45¢ until six). The red popcorn machine. And lots of old men."], "179": ["I remember the sound of the ice cream man coming."], "893": ["I remember Kon Tiki."], "929": ["I remember that my vision of germs pretty much resembled normal insects, only much smaller, of course."], "625": ["I remember queer bars."], "454": ["I remember the scandal Jane Russell’s costume in The French Line caused."], "270": ["I remember a very wet dream with J. J. Mitchell in a boat."], "697": ["I remember looking cross-eyed and being told not to do that because they might get stuck and I’d be cross-eyed for life."], "1380": ["I remember Anne Kepler. She played the flute. I remember her straight shoulders. I remember her large eyes. Her slightly roman nose.", "And her full lips. I remember an oil painting I did of her playing the flute.", "Several years ago she died in a fire giving a flute concert at a children’s home in Brooklyn.", "All the children were saved. There was something about her like white marble."], "519": ["I remember jacks."], "650": ["I remember “white trash.”"], "317": ["I remember making home-made ice cream."], "281": ["I remember farts that smell like old eggs."], "1006": ["I remember fantasies of someday reading a complete set of encyclopedias and knowing everything."], "409": ["I remember trying to visualize what my insides looked like."], "54": ["I remember collecting cigarette butts from the urns in front of The Museum of Fine Arts in Boston."], "510": ["I remember when pink grapefruit was a big treat."], "928": ["I remember trying to visualize germs (physically) as they crawl around all over everything."], "1378": ["I remember a big red satin wide-brimmed hat with red silk poppies all over it Mrs. Hawks wore to church one Easter Sunday.", "She was married to Mr. Hawks who owned the local ice cream company.", "She was an ex-Dior model and everyone thought she was very ugly except me. (“Skinny and weird looking.”)", "In my head it is still the most beautiful hat I have ever seen."], "1117": ["I remember chipped beef and gravy on toast."], "599": ["I remember that cats have nine lives."], "977": ["I remember (on popular boys) plain loafers: the kind of “plain” you had to pay through the nose for."], "1361": ["I remember the great girl-love of my life. We were both the same age but she was too old and I was too young. Her name was Marilyn Mounts.", "She had a small and somehow very vulnerable neck. It was a long thin neck, but soft. It looked like it would break very easily."], "153": ["I remember bean bag ashtrays that would stay level on irregular surfaces."], "661": ["I remember jumping into piles of leaves and the dust, or whatever it is, that rises."], "399": ["I remember getting rid of everything I owned on two occasions."], "632": ["I remember “jewels” neatly placed down the left pantleg or the right."], "718": ["I remember “See you later alligator!”"], "1156": ["I remember cartoon stars when someone gets hit over the head. And light bulbs for a bright idea."], "1093": ["I remember crocheted doilies on the backs and arms of big stuffed chairs."], "51": ["I remember when I worked in an antique-junk shop and I sold everything cheaper than I was supposed to."], "682": ["I remember not being able to fall asleep Christmas Eve."], "1132": ["I remember empty Sunday afternoons of feeling somehow all “empty” inside."], "695": ["I remember once my mother parading a bunch of women through the bathroom as I was taking a shit. Never have I been so embarrassed!"], "13": ["I remember how much I used to stutter."], "172": ["I remember reading Van Gogh’s letters to Theo."], "378": ["I remember in Dayton, Ohio, the art fair in the park where they made me take down all my naked self-portraits."], "765": ["I remember a girl who had dead corsages all around her circular dressing table mirror."], "1249": ["I remember (stoned) when the most profound thought in the world totally evaporates before you can find a pencil."], "1186": ["I remember (ouch!) bare feet on hot summer sidewalks."], "816": ["I remember thinking that if you didn’t return stamp approvals you’d really get in trouble."], "494": ["I remember how beautiful snow made the Lower East Side look. (So black and white.)"], "336": ["I remember “Blue Suede Shoes.” And I remember having a pair."], "1058": ["I remember body realizations about how fragile we (life) really are (is)."], "1078": ["I remember floating transparent spots before my eyes, every now and then, for a moment (microscopic) like when you stand up real fast."], "851": ["I remember trying to get the last of cat food from a can."], "260": ["I remember “Well, it may be good but I just don’t understand it.”"], "835": ["I remember clear plastic high heels with no straps in back."], "775": ["I remember a piece of old wood with termites running around all over it the termite men found under our front porch."], "264": ["I remember Bermuda shorts and knee-length socks."], "581": ["I remember when you do that motorboat-like thing with your lips how your nose starts tickling."], "619": ["I remember Amos and Andy. Life with Father. And Francis the Talking Mule."], "439": ["I remember a girl in grade school who had shiny legs that were cracked like a Chinese vase."], "1167": ["I remember poking my finger into cellophane-wrapped blobs of meat impossible to imagine someone might actually eat."], "1221": ["I remember a boy who could swig down a Coke in one big gulp, followed by a long loud belch."], "524": ["I remember sassafras tea, turnips, and persimmons."], "403": ["I remember “Ace” combs."], "1309": ["I remember when father seemed too formal, and daddy was out of the question, and dad seemed too fake-casual.", "But, seeming the lesser of three evils, I chose fake-casual."], "137": ["I remember milkmen. Postmen. Guest towels. “Welcome” mats. And Avon ladies."], "496": ["I remember “Folk City.” “Man Power.” And selling books at “The Strand.”"], "673": ["I remember some beautiful German Christmas tree ornaments in the shape of birds and houses and people."], "1059": ["I remember trying to figure things out—(life)—trying to get it all down to something basic—and ending up with nothing. Except a dizzy head."], "269": ["I remember jerking off to sexual fantasies involving John Kerr. And Montgomery Clift."], "1206": ["I remember unpopular dogs that were allowed to roam the neighborhood freely. And—“Don’t forget to close the gate behind you!”"], "1382": ["I remember a boy I tried to pick up once.", "As an opener I told him he had a nice nose and he said he was thinking about having it “fixed” and I said no he shouldn’t.", "He said he was busy that night but he took my phone number. (Never did call, though.)", "Maybe I put him off by saying that I thought psychology was a bit silly. (He was a psychology major.)", "“Too self indulgent,” I remember saying. (I was drunk.) Actually his nose was a bit too big."], "193": ["I remember radio ball game sounds coming from the garage on Saturday afternoons."], "807": ["I remember pink underwear sometimes when something red faded in the wash."], "1083": ["I remember “parking.”"], "777": ["I remember the “Goodyear” tire foot with wings. And the flying red horse."], "1143": ["I remember over-tipping. And I still do."], "257": ["I remember monkeys who did modern paintings and won prizes."], "167": ["I remember a boy. He worked in a store. I spent a fortune buying things from him I didn’t want. Then one day he wasn’t there anymore."], "356": ["I remember wood carvings of funny doctors."], "637": ["I remember coming home from queer bars and bawling myself out for not having more confidence in myself."], "306": ["I remember “Autumn Leaves.”"], "1332": ["I remember a backdrop of a brick wall I painted for a play. I painted each red brick in by hand.", "Afterwards it occurred to me that I could have just painted the whole thing red and put in the white lines."], "667": ["I remember usually getting dressed up as a hobo or a ghost. One year I was a skeleton."], "301": ["I remember rainbow-colored grease spots on the pavement after a rain."], "482": ["I remember thinking how awful it would be to be responsible for a fire that took lives. Or for a car wreck."], "1055": ["I remember those times of not knowing if you feel really happy or really sad. (Wet eyes and a high heart.)"], "410": ["I remember almost sending away for body building courses many times."], "1205": ["I remember once secretly planting some watermelon seeds out in the backyard but nothing happened."], "107": ["I remember Easter suits."], "1316": ["I remember the exact moment, during communion, that was the hardest to keep from smiling.", "It was when you had to stick out your tongue and the minister laid the white wafer on it."], "1279": ["I remember eating alone in restaurants a lot because of some sort of perverse pleasure I don’t want to think about right now.", "(Because I still do it.)"], "941": ["I remember closely examining the opening in the head of my cock once, and how it reminded me of a goldfish’s mouth."], "108": ["I remember taffeta. And the way it sounded."], "294": ["I remember glimpses of activity in orange windows at night."], "460": ["I remember “Payday” candy bars and eating the peanuts off first and then eating the center part."], "303": ["I remember, in Tulsa, a red sidewalk that sparkled."], "1080": ["I remember (after school) soda fountain shops with booths, and a juke box, but only in the movies."], "576": ["I remember rumors about what Marlon Brando had to do to get his first acting job."], "59": ["I remember going to the ballet with Edwin Denby in a red car coat."], "484": ["I remember my father trying to get splinters out of my fingers with a needle."], "543": ["I remember not going to the bathroom in public places if I didn’t know where it was."], "67": ["I remember Liberace."], "1044": ["I remember the cherries on Marilyn Monroe’s dress playing paddle-ball in The Misfits."], "736": ["I remember making sure my little finger didn’t stick out."], "947": ["I remember wondering about the shit (?) (ugh) in fucking up the butt."], "883": ["I remember daydreams of being a very smart dresser."], "144": ["I remember Saturday night baths and Sunday morning comics."], "1195": ["I remember bird pictures from Mexico made out of real feathers, with hand-carved frames."], "154": ["I remember shower curtains with angel fish on them."], "1267": ["I remember how sorry I felt for my father’s sister.", "I thought that she was always on the verge of crying, when actually, she just had hay fever."], "293": ["I remember tricycles turned over on front lawns. Snowball bushes. And plastic duck families."], "887": ["I remember big square glass bricks with a “wavy” surface."], "187": ["I remember Marilyn Monroe’s softness in The Misfits."], "9": ["I remember how good a glass of water can taste after a dish of ice cream."], "231": ["I remember saying “thank you” when the occasion doesn’t call for it."], "340": ["I remember the horse lady at the fair. She didn’t look like a horse at all."], "931": ["I remember a piece of soft pink cloth with zigzag edges, to clean new glasses with."], "1065": ["I remember white rubber sink plugs on chains."], "235": ["I remember zipper notebooks. I remember that girls hugged them to their breasts and that boys carried them loosely at one side."], "247": ["I remember when I started smoking I wrote my parents a letter and told them so. The letter was never mentioned and I continued to smoke."], "857": ["I remember the pale green tint of Coca-Cola bottles."], "375": ["I remember having a casual chat with God every night and usually falling asleep before I said, “Amen.”"], "406": ["I remember the skinny guy who gets sand kicked in his face in body-building advertisements."], "1190": ["I remember inching myself down into water that was too hot."], "547": ["I remember fantasies of my cock growing quite large just overnight. (A medical mystery!)"], "735": ["I remember not crossing my legs. (Knee over knee.) I thought that looked queer."], "764": ["I remember not understanding why women in dresses didn’t freeze their legs off in the winter time."], "279": ["I remember green Easter egg grass."], "499": ["I remember a very old man who lived next door to me on Avenue B. He is most surely dead by now."], "488": ["I remember daydreams of being a big success in New York City. (Penthouse and all!)"], "634": ["I remember loud sexy music. Too much beer. Quick glances. And not liking myself for playing the game too."], "466": ["I remember marbles."], "1128": ["I remember the noisy mass flipping of pages when the next hymn is announced."], "860": ["I remember cold turkey sandwiches."], "870": ["I remember stories about parents throwing their babies into the water, and just by instinct they learn to swim."], "312": ["I remember rearranging boxes of candy so it would look like not so much was missing."], "445": ["I remember not liking mashed potatoes if there was a single lump in them."], "6": ["I remember my first erections. I thought I had some terrible disease or something."], "613": ["I remember my father’s collection of Zane Grey novels and one “dirty” book called Let’s Make Mary."], "701": ["I remember finding some strange-looking stamps in a box and being told that you got food with them during the war."], "1008": ["I remember beautifully colored pastel floor plans of houses, on detective paperback backs."], "711": ["I remember jungle gyms and girls who didn’t care if you saw their panties or not."], "690": ["I remember the controversy over whether to install a Coke machine in the church basement or not."], "416": ["I remember stories about razor blades being hidden in apples at Halloween. And pins and needles in popcorn balls."], "311": ["I remember a very clean Catholic book-gift shop with practically nothing in it to buy."], "785": ["I remember watching my hair fall and accumulate."], "228": ["I remember thinking how embarrassing it must be for men in Scotland to have to wear skirts."], "337": ["I remember felt skirts with cut-out felt poodles on them. Sometimes their collars were jeweled."], "467": ["I remember having marbles more than I remember playing marbles."], "98": ["I remember when I wanted to be rich and famous. (And I still do!)"], "1182": ["I remember a girl with hair down to past her waist until she had to cut it off because it got so heavy her hairline was receding."], "451": ["I remember one boy with an absolutely enormous cock. And he knew it. He was always last to get dressed. (Putting his socks on first.)"], "1202": ["I remember that a good way to get a “maybe” instead of a “no” is to ask for what you want in front of company."], "1334": ["I remember having a crush on a boy in my Spanish class who had a pair of olive green suede shoes with brass buckles just like a pair I had.", "(“Flagg Brothers.”) I never said one word to him the entire year."], "68": ["I remember “Liberace loafers” with tassels."], "1074": ["I remember canned creamed corn."], "142": ["I remember the chair I used to put my boogers behind."], "550": ["I remember reading somewhere that the average cock is from six to eight inches when erect, and grabbing for the nearest ruler."], "766": ["I remember a brief period in high school when it was popular to spray a silver streak in your hair."], "495": ["I remember Klein’s at Christmas time."], "692": ["I remember hoola-hoops."], "1340": ["I remember one day in gym class when my name was called out I just couldn’t say “here.”", "I stuttered so badly that sometimes words just wouldn’t come out of my mouth at all. I had to run around the field many times."], "20": ["I remember a dream I had recently where John Ashbery said that my Mondrian period paintings were even better than Mondrian."], "1160": ["I remember spatter-painting autumn leaf silhouettes with a toothbrush and a piece of screen door wire."], "848": ["I remember alligator purses."], "324": ["I remember wondering why God didn’t use his powers more to end wars and stop polio. And stuff like that."], "1149": ["I remember blowing the white fuzz off dandelions after the petals are gone."], "1028": ["I remember “rave review” fantasies. And sell-out shows."], "1030": ["I remember (ugh) hound drops."], "745": ["I remember “Sloppy Joes.”"], "196": ["I remember my father in a tutu. As a ballerina dancer in a variety show at church."], "305": ["I remember how exciting a glimpse of a naked person in a window is even if you don’t really see anything."], "339": ["I remember jeweled bottle openers."], "1194": ["I remember not very scary ghost stories, except for the dark they were told in."], "635": ["I remember enjoying playing the game too, though."], "1166": ["I remember that because someone else had already done the dirty work it made it to my mind “O.K.”"], "904": ["I remember the elephant stampede in Elephant Walk."], "948": ["I remember ping-pong ball dents."], "767": ["I remember seeing a 3-D movie once and wearing red and green cellophane glasses. And 3-D comic books too."], "62": ["I remember my grade school art teacher, Mrs. Chick, who got so mad at a boy one day she dumped a bucket of water over his head."], "726": ["I remember that area of white flesh between the pant cuffs and the socks when old men cross their legs."], "161": ["I remember a purple violin bottle that hung on the wall with ivy growing out of it."], "127": ["I remember ringworms. And name tags."], "1225": ["I remember record stores with glass windowed booths you could play records in before you bought them, or didn’t."], "1095": ["I remember (z - z - z) plastic place mats the texture of woven straw."], "84": ["I remember many Septembers."], "1069": ["I remember birthday parties."], "1113": ["I remember (pulling skin around eyes into “Oriental”) “Mommy, you made my braids too tight!”"], "136": ["I remember game rooms in basements."], "50": ["I remember Dorothy Collins’ teeth."], "899": ["I remember the small diamond heart necklace that Arlene Francis always wore on What’s My Line?"], "1240": ["I remember the different ways people have of not eating their toast crust."], "114": ["I remember “four o’clocks.” (A flower that closes at four.)"], "924": ["I remember dining room table leaves."], "124": ["I remember home-room mothers."], "448": ["I remember pedal-pushers."], "549": ["I remember Coke bottle stories."], "818": ["I remember “Silly Putty” in a plastic egg."], "1219": ["I remember “close dancing,” with arms dangling straight down."], "338": ["I remember bright orange canned peaches."], "1033": ["I remember little round paper clips to attach the price of greeting cards to the card with."], "77": ["I remember Perry Como shirts. And Perry Como sweaters."], "1358": ["I remember a story about a couple who owned a diner. The husband murdered his wife and ground her up in the hamburger meat.", "Then one day a man was eating a hamburger at the diner and he came across a piece of her fingernail. That’s how the husband got caught."], "131": ["I remember those brown fur pieces with little feet and little heads and little tails."], "1271": ["I remember every other Saturday having to get a haircut.", "And how the barber was always clicking his scissors even when he wasn’t cutting anything."], "1134": ["I remember Monday mornings. And Friday afternoons."], "705": ["I remember orange candy shaped like big peanuts with lots of air in it."], "148": ["I remember strapless net formals in pastel colors that came down to the ankles. And carnation corsages on little short jackets."], "146": ["I remember potato salad."], "561": ["I remember trying to imagine my grandfather naked. (Eck!)"], "1131": ["I remember a lot of standing around and talking outside on the steps afterwards."], "580": ["I remember hair not being messed up when it should be messed up."], "800": ["I remember being very proud of myself the next morning, nevertheless."], "1200": ["I remember (when relatives come visit) “getting away with murder.”"], "1242": ["I remember stories about how L. B. J. got off on holding private conferences while on the john."], "353": ["I remember what-not shelves of two overlapping squares. One higher than the other."], "91": ["I remember wild red poppies in Italy."], "1218": ["I remember “double dating,” and “going dutch,” and autographing broken leg casts."], "318": ["I remember that I liked store-bought ice cream better."], "352": ["I remember wax paper."], "1020": ["I remember little packages of colored sugar-like stuff, and just about every different color of tongues."], "1119": ["I remember DDT."], "891": ["I remember the Liz-Eddie-Debbie scandal."], "366": ["I remember being disappointed in Europe that I didn’t feel any different."], "230": ["I remember how little your dick is, getting out of a wet bathing suit."], "878": ["I remember wondering how one would go about putting on a rubber gracefully, in the given situation."], "562": ["I remember the rumor that if a black and a white person got married and had a baby it might turn out black and white spotted."], "1248": ["I remember (stoned) reaching out for a joint that isn’t really being passed to you yet."], "380": ["I remember white bread and tearing off the crust and rolling the middle part up into a ball and eating it."], "900": ["I remember the “swoosh” of Loretta Young’s skirt as she entered the room each week."], "854": ["I remember a free shoehorn with new shoes."], "1307": ["I remember a “Clove” chewing gum period. And a “Juicy-fruit” chewing gum period.", "And then (high school) a period when “Dentyne” somehow seemed a sophisticated choice."], "87": ["I remember when my father would say “Keep your hands out from under the covers” as he said goodnight. But he said it in a nice way."], "773": ["I remember filling the ice trays too full and trying to get them back to the refrigerator without spilling any."], "1373": ["I remember the first erection I distinctly remember having. It was by the side of a public swimming pool.", "I was sunning on my back on a towel. I didn’t know what to do, except turn over, so I turned over. But it wouldn’t go away.", "I got a terrible sunburn. So bad that I had to go see a doctor. I remember how much wearing a shirt hurt."], "1060": ["I remember “Now I lay me down to sleep (etc.)”"], "1264": ["I remember light blue morning glories on the fence in the morning. Morning glories always surprise me.", "I never really expect them to be there."], "387": ["I remember tying two bicycles together for a production number of “Bicycle Built for Two.”"], "95": ["I remember Black Beauty."], "713": ["I remember “dress up time.” (Running around pulling up girls’ dresses yelling “dress up time.”)"], "1304": ["I remember finding $21 in a black coin purse in a big department store in St. Louis.", "I reported having found it but since nobody reported losing it I got to keep it."], "150": ["I remember bunk beds."], "42": ["I remember butter and sugar sandwiches."], "1257": ["I remember wanting to change my name to Jacques Bernard."], "517": ["I remember every year in school having to write an essay on thrift for some annual thrift essay contest, and never winning."], "1135": ["I remember Saturdays."], "21": ["I remember a dream I have had often of being able to fly. (Without an airplane.)"], "1203": ["I remember, in pajamas with feet, long acrobatic kisses in grown-up laps to prolong “bed” for as long as possible."], "33": ["I remember round cards."], "60": ["I remember learning to play bridge so I could get to know Frank O’Hara better."], "1237": ["I remember dashes for dirty words in adult novels."], "731": ["I remember daydreams of leaving home and getting a job and an apartment of my own."], "319": ["I remember hospital supply store windows."], "123": ["I remember driving through the Ozarks and all the gift shops we didn’t stop at."], "420": ["I remember that Betty Grable didn’t smoke or drink or go to Hollywood parties."], "36": ["I remember the first ballpoint pens. They skipped, and deposited little balls of ink that would accumulate on the point."], "1247": ["I remember (spooky) when all of a sudden someone you know very well becomes momentarily a total stranger."], "937": ["I remember gardenia petal brown spots."], "953": ["I remember jumping beans, and how disappointing they were. (Lazy.) A few flip-flops, and that was that."], "1377": ["I remember daydreams of being discovered by a Hollywood agent who would send me to a special place in California where they “re-do” people.", "(Very expensive.)", "They’d cap my teeth and make my hair look great and make me gain weight and give me muscles and I’d come out looking great.", "On my way to being a star.", "(But first I’d go home and shock everybody.)"], "1068": ["I remember (in the “But why?” department) “Because I say so, that’s why!”"], "809": ["I remember lint all over blue jeans when you forgot and left a Kleenex in your pocket."], "569": ["I remember thinking those sandals and short skirts rather impractical for war."], "225": ["I remember that my father scratched his balls a lot."], "652": ["I remember looking at myself in a mirror and becoming a total stranger."], "315": ["I remember alligators and quicksand in jungle movies. (Pretty scary.)"], "609": ["I remember “My Wild Irish Rose.”"], "1011": ["I remember the little “thuds” of bugs bumping up against the screens at night."], "1254": ["I remember movies in school about kids that drink and take drugs and then they have a car wreck and one girl gets killed."], "1300": ["I remember my first pep pill. Ted Berrigan gave it to me. I stayed up all night doing hundreds of drawings.", "I especially remember one drawing of a cup of coffee."], "476": ["I remember that “Negroes who drive around in big shiny Cadillacs usually live in broken-down shacks.”"], "724": ["I remember that the red Crayola was always the first to go."], "169": ["I remember white buck shoes with thick pink rubber soles."], "1363": ["I remember in junior high school asking a girl who was much too popular and pretty for me to a dance and she said, “Yes.”", "But the moment we arrived she disappeared into a group of her friends and I didn’t see her again all evening.", "I think her name was Nancy. Yes, it was."], "1234": ["I remember traveling salesmen jokes way over my head, which didn’t keep me from finding them funny anyway."], "1077": ["I remember, when your beet juice runs into your mashed potatoes—red mashed potatoes!"], "38": ["I remember Aunt Cleora who lived in Hollywood. Every year for Christmas she sent my brother and me a joint present of one book."], "1": ["I remember the kick I used to get going through my parents’ drawers looking for rubbers. (Peacock.)"], "527": ["I remember continuing my return address on envelopes to include “The Earth” and “The Universe.”"], "1026": ["I remember looking out of the windows, riding buses uptown, sudden fantasy flashes of everybody out there on the streets being naked."], "746": ["I remember shoulder pads. Cinnamon toothpicks. And “John Doe.”"], "806": ["I remember “Two hairs past a freckle” when someone asks you what time it is and you don’t have a watch."], "162": ["I remember very old people when I was very young. Their houses smelled funny."], "66": ["I remember liver."], "350": ["I remember taking out the garbage."], "245": ["I remember that I never cried in front of other people."], "65": ["I remember when I was a “Demolay.” I wish I could remember the secret handshake so I could reveal it to you."], "334": ["I remember how sad The Jane Froman Story was."], "730": ["I remember daydreams of being a girl and of the beautiful formals I would have."], "1109": ["I remember tie clips that were hard to keep straight."], "979": ["I remember the fear of—what if all of a sudden out in the middle of public somewhere you get a hard-on?"], "1047": ["I remember Maria Schell’s very wet eyes in The Brothers Karamazov."], "237": ["I remember never thinking Ann Miller beautiful."], "733": ["I remember making sure that I held my cigarette in not a queer way."], "377": ["I remember that little jerk you give just before you fall asleep. Like falling."], "969": ["I remember big yellow mum corsages, on brown beaver fur coats, at football games, in magazine pictures."], "756": ["I remember baby shoes hanging from car rear-view mirrors."], "1185": ["I remember infuriating finger cuts from pieces of paper."], "799": ["I remember early sexual experiences and rubbery knees. I’m sure sex is much better now but I do miss rubbery knees."], "614": ["I remember plaster of paris."], "1294": ["I remember a young blond bland psychology teacher with a face impossible to recall. (Big black glasses.)", "I remember trying to find him sexy, but it was hard."], "201": ["I remember drive-in onion rings."], "1301": ["I remember Dinah Shore’s energetic rendition of “See the U.S.A. in Your Chevrolet.” And then a big “smack!” And then lots of teeth.", "And then lots of eye sparkle."], "1098": ["I remember, after being outside in the sun for awhile, going inside, and the few moments or so of seeing almost negative."], "1342": ["I remember being Joseph in a live nativity scene (that didn’t move) in a park.", "You just had to stand there for half an hour and then another Joseph came and you had a cup of hot chocolate until your turn came again."], "1281": ["I remember, eating out alone in restaurants, trying to look like I have a lot on my mind.", "(Primarily a matter of subtle mouth and eyebrow contortions.)"], "1335": ["I remember when I told Kenward Elmslie that I could play tennis.", "He was looking for someone to play with and I wanted to get to know him better.", "I couldn’t even hit the ball but I did get to know him better."], "788": ["I remember the very ornate chrome foot rest. And the old Negro shoeshine man."], "1297": ["I remember a little girl who had a white rabbit coat and hat and muff. Actually, I don’t remember the little girl.", "I remember the coat and the hat and the muff."], "1066": ["I remember not to stand up in the bathtub because I might slip and fall and bash my head open."], "1053": ["I remember a fashion newsreel about live bug jewelry on a chain that crawled all over you."], "438": ["I remember really getting in trouble once for trading a lot of expensive toys for a rock and a pocket knife."], "1017": ["I remember, one summer way back, a new pair of red sandals. And I hated sandals."], "1346": ["I remember a spooky job I had once cleaning up a dentist’s office after everyone had gone home. I had my own key.", "The only part I liked was straightening up the magazines in the waiting room. I saved it as the last thing to do."], "155": ["I remember Christmas card wastebaskets."], "394": ["I remember buying things that were too expensive because I didn’t like to ask the price of things."], "248": ["I remember how good wet dreams were."], "171": ["I remember summer naps of no sleeping. And Kool-Aid."], "433": ["I remember socks that won’t stay up."], "694": ["I remember a little boy who said it was more fun to pee together than alone, and so we did, and so it was."], "1277": ["I remember the school cafeteria. Silverware clanking noises. Stacks of chipped brown trays. Little cartons of milk.", "And red Jell-o cut up into cubes."], "419": ["I remember that Rock Hudson was a truck driver."], "390": ["I remember making tents on the front porch on rainy days."], "595": ["I remember Jane and Dick and Sally and Spot and the nice policeman and “Run, run, run.”"], "427": ["I remember being embarrassed to buy toilet paper at the corner store unless there were several other things to buy too."], "914": ["I remember Marilyn Monroe in fuchsia satin, as reflected in many mirrors."], "1252": ["I remember taking communion and how hard it was not to smile."], "48": ["I remember The Hit Parade."], "328": ["I remember catching lightning bugs and putting them in a jar with holes in the lid and then letting them out the next day."], "638": ["I remember thinking I could sing (had a good voice) until somehow in school I discovered I didn’t."], "685": ["I remember opening my first packages very fast and my last few very slowly."], "834": ["I remember bright colored bubble bath balls. And bathtub “rings.”"], "559": ["I remember old women’s flesh-colored hose you can’t see through."], "233": ["I remember saying “thank you” in reply to “thank you” and then the other person doesn’t know what to say."], "285": ["I remember regretting things I didn’t do."], "221": ["I remember slipping underwear into the washer at the last minute (wet dreams) when my mother wasn’t looking."], "120": ["I remember how heavy the cornbread was."], "880": ["I remember cold sheets in the winter time."], "1120": ["I remember nothing to say when someone tells you that your fly is unzipped."], "751": ["I remember when the bigger the cuffs on blue jeans were the better."], "276": ["I remember the wrinkles and creases of fabric being worn."], "662": ["I remember raking leaves but I don’t remember burning leaves. I don’t remember what we “did” with them."], "372": ["I remember how much rock and roll music can hurt. It can be so free and sexy when you are not."], "752": ["I remember “5-Day Deodorant Pads.”"], "1238": ["I remember, when a fart invades a room, trying to look like I didn’t do it, even if, indeed, I didn’t."], "1216": ["I remember (Oklahoma) boring annual Indian pageants of many feathers, and much stomping."], "195": ["I remember my father in black-face. As an end man in a minstrel show."], "698": ["I remember a story about somebody finding a baby alligator in their toilet bowl."], "246": ["I remember how embarrassed I was when other children cried."], "1198": ["I remember, up high, wallpaper borders."], "398": ["I remember trying to blow myself once but I couldn’t quite do it."], "564": ["I remember white marshmallow powder on lips."], "1148": ["“I knew it!”"], "902": ["I remember, out walking in the rain, people scurrying by with their faces all crunched up."], "725": ["I remember always drawing girls with their hands behind their backs. Or in pockets."], "180": ["I remember once losing my nickel in the grass before he made it to my house."], "1085": ["I remember “petting.”"], "719": ["I remember suspenders and bow ties and red leather mittens."], "1114": ["I remember (squashing face between hands) “Bus driver, will you please open the door?”"], "361": ["I remember board and brick bookshelves."], "797": ["I remember that popular boys always had their blue jeans worn down just the right amount."], "959": ["I remember “one iota” and “to coin a phrase.”"], "861": ["I remember trying to pull a Band-aid off with one quick yank."], "958": ["I remember those sexy little ads in the back of Esquire magazine of skimpy bathing suits and underwear with enormous baskets."], "659": ["I remember autumn."], "347": ["I remember Judy Garland’s red shoes in The Wizard of Oz."], "708": ["I remember a coconut kind of candy that looked like thin slices of watermelon."], "1270": ["I remember sexual fantasies in white tile shower rooms. Hard and slippery. Abstract and steamy. Wet body to wet body.", "Slippery, fast, and squeaky."], "121": ["I remember crêpe paper roses. Old calendars. And cow patties."], "1362": ["I remember, finally, learning to float. But I never did really believe it was the water that was holding me up.", "I suppose I somehow thought I was doing it through sheer willpower. (Mind over matter, so to speak.)", "At any rate, I never did give any credit to the water."], "631": ["I remember “baskets.”"], "829": [">Tonto lost his underwear"], "1155": ["I remember blowing up paper bags to pop."], "468": ["I remember playing hopscotch without ever really knowing the rules."], "272": ["I remember navels. Torso muscles. Hands. Arms with large veins. Small feet. (I like small feet.) And muscular legs."], "516": ["I remember green grass knee stains."], "128": ["I remember always losing one glove."], "49": ["I remember Dorothy Collins."], "1111": ["I remember face jokes."], "333": ["I remember eating tunnels and cities out of watermelon."], "518": ["I remember not understanding how a baby could come out of such a small hole. (Still don’t.)"], "1094": ["I remember maroon and navy blue felt house shoes, with fuzzy balls on top."], "865": ["I remember some teachers that would let you get up to use the pencil sharpener without having to ask."], "761": ["I remember not understanding how the photographer could have just stood there and taken that picture."], "492": ["I remember Ukrainian Easter eggs all year round."], "1310": ["I remember when girls wore lots of can-can slips. It got so bad (so noisy) that the principal had to put a limit on how many could be worn.", "I believe the limit was three."], "1122": ["I remember, at parties, after you’ve said all you can think of to say to a person—but there you both stand."], "103": ["I remember Beverly who had a very small cross tattooed on her arm."], "1063": ["I remember (hurt like hell) Saturday night hair washings of fingernails to scalp."], "475": ["I remember “colored town.” (Tulsa.)"], "1176": ["I remember not understanding why Cinderella didn’t just pack up and leave, if things were really all that bad."], "844": ["I remember, sitting out in the out-house, wondering why it never got filled up."], "1313": ["I remember “Mother’s Day” and wearing a red rose to church in my lapel.", "(You wore a white rose if your mother was dead. And a yellow rose if your mother was a step-mother.)"], "1012": ["I remember, at night, heading out into the black to pee, and imagining all the things I might be just about to step on, or “in.”"], "1187": ["I remember once on T.V. news an egg being fried on the sidewalk as an example of just how hot the heat wave we were having really was."], "587": ["I remember tap dancing recitals."], "57": ["I remember the day Marilyn Monroe died."], "1199": ["I remember, when relatives come visit, a cot."], "840": ["I remember my mother telling stories about funny things I’d do and how the stories got funnier each time they were told."], "1357": ["I remember church camp and “the quiet hour” and weaving plastic braid around strips of metal to make bracelets.", "And weaving plastic braid into things to hang around your neck to hang whistles from.", "And always the possibility of running into a copperhead."], "29": ["I remember sack dresses."], "1136": ["I remember the washing machine and the vacuum cleaner going at the same time."], "1276": ["I remember jerking off to sexual fantasies of Troy Donahue with a dark tan in a white bathing suit down by the ocean.", "(From a movie with Sandra Dee.)"], "1123": ["I remember trying to have a conversation with someone once with a hair sticking out of his nose."], "487": ["I remember daydreams of inheriting lots of money from some relative I didn’t even know I had."], "532": ["I remember once when it was raining on one side of our fence but not on the other."], "753": ["I remember “The Arthur Murray Party.”"], "1163": ["I remember, after eating ice cream too fast, a cold head rush."], "1289": ["I remember believing that you could get warts by touching frogs enough that I . . .", "Actually, I was such a big sissy I wouldn’t have touched a frog anyway."], "704": ["I remember little wax bottles with very sweet liquid inside."], "199": ["I remember cherry Cokes."], "1005": ["I remember starting a set of supermarket encyclopedias, but three was as far as we got."], "1321": ["I remember “Ma and Pa Kettle.” “Dishpan hands.” Linoleum. Cyclone fences. Shaggy dog stories. Stucco houses.", "Pen and pencil sets. Tinker Toys. Lincoln Logs. And red blue jeans for girls."], "1376": ["I remember that our church believed that when the Bible said wine it really meant grape juice.", "So at communion we had grape juice. And round paper-thin white wafers that tasted very good. Like paper.", "Once I found a whole jar full of them in a filing cabinet in the choir room and I ate a lot.", "Eating a lot was not as good as eating just one."], "514": ["I remember potato sack races."], "905": ["I remember Elizabeth Taylor in tons of white chiffon in—also in Elephant Walk, I think it was."], "1246": ["I remember making designs in the dark with a fast-moving lit cigarette."], "396": ["I remember wondering why, since I am queer, I wouldn’t rather be a girl."], "192": ["I remember never winning at bingo, though I’m sure I must have."], "1162": ["I remember when someone grabs your arm with both hands twisting in opposite directions—an “Indian burn.”"], "1147": ["“Pisces.”"], "1099": ["I remember the smell of Jergen’s hand lotion on hands. And its pearly white texture as it oozes from the bottle."], "1041": ["I remember digging around in ice cold water for an orange soda pop."], "157": ["I remember big brass wall plates of German drinking scenes. (Made in Italy.)"], "1170": ["I remember (Easter) drawing on white eggs with a white Crayola before dipping them."], "296": ["I remember that there is always one soldier on every bus."], "383": ["I remember rings around your neck. (Dirt.)"], "348": ["I remember Christmas tree lights reflected on the ceiling."], "280": ["I remember never really believing in the Easter bunny. Or the sandman. Or the tooth fairy."], "222": ["I remember a giant gold man taller than most buildings at “The Tulsa Oil Show.”"], "1350": ["I remember a fat man who sold insurance.", "One hot summer day we went to visit him and he was wearing shorts and when he sat down one of his balls hung out.", "I remember that it was hard to look at it and hard not to look at it too."], "590": ["I remember parliamentary procedure. Multiple choice questions. And paper curtains."], "926": ["I remember that “most bad breath is caused by germs.”"], "962": ["I remember “Double Bubble” gum comics, and licking off the sweet “powder.”"], "605": ["I remember a toothpick holder with a bird that picked up the toothpick with his beak for you when you did something (?) to his tail."], "819": ["I remember silent moments in church when my stomach would decide to growl."], "117": ["I remember my grandfather who lived on a farm dunking his cornbread in his buttermilk. He didn’t like to talk."], "791": ["I remember balloon sleeves. And no sleeves."], "1076": ["I remember roast beef and carrots and potatoes and gravy and, underneath it all, a piece of soggy white bread: the best part."], "17": ["I remember when I decided to be a minister. I don’t remember when I decided not to be."], "384": ["I remember staying in the bathtub too long and having wrinkled toes and fingers."], "1102": ["I remember wondering about the comfort and practicality of wooden shoes."], "622": ["I remember thinking how embarrassing it would be if your name was Hitler."], "1266": ["I remember a little boy I used to take care of after school while his mother worked.", "I remember how much fun it was to punish him for being bad."], "782": ["I remember talk about one drugstore that was easy to get them at."], "1067": ["I remember “This is the last time I’m going to tell you.”"], "61": ["I remember playing bridge with Frank O’Hara. (Mostly talk.)"], "570": ["I remember how very black and white early “art” movies were."], "643": ["I remember chartreuse."], "604": ["I remember Rudolph the Red-Nosed Reindeer."], "656": ["I remember wooden nickels."], "1306": ["I remember Jim and Lucy. Jim sold insurance and Lucy taught school.", "Every time we saw them they gave us a handful of plastic billfold calendars advertising insurance."], "796": ["I remember plain camel hair coats that rich girls in high school wore."], "425": ["I remember “Your front door is open.” Or maybe it was “Barn door.” Or both."], "1153": ["I remember “Go to jail—pass go—do not collect $200.”"], "426": ["I remember “bathroom stationery.”"], "140": ["I remember when fiberglass was going to solve everything."], "808": ["I remember sometimes blue underwear."], "526": ["I remember Lazy Susans."], "789": ["I remember having an itchy back all the way home."], "1169": ["I remember how that “powdered cheese” you put on spaghetti smelled suspiciously like dirty feet to me."], "556": ["I remember fantasies of making the back seat of a car “livable” with curtains, a fold-away kitchen, etc."], "53": ["I remember (Boston) panhandling on the street where all the art galleries were."], "462": ["I remember how boring newsreels were."], "828": [">“High-ho Silver in the air"], "668": ["I remember one house that always gave you a dime and several houses that gave you five-cent candy bars."], "96": ["I remember when I thought that Betty Grable was beautiful."], "509": ["I remember satin jackets from Japan with embroidered dragons and American flags on the backs."], "639": ["I remember that Picasso was born in 1881. (Having no memory for facts, I once made myself memorize that fact and I’ve never forgotten it.)"], "655": ["I remember “Queer as a three dollar bill.”"], "707": ["I remember looking very close at cotton candy and seeing that it was made up of little red “beads.”"], "1043": ["I remember a lot of movie star nose job rumors."], "1072": ["I remember how hard it was to get a round of “Happy Birthday” going."], "687": ["I remember feeling sorry for kids at church, or school, who had ugly mothers."], "1177": ["I remember getting a car door slammed on my finger once, and how long it took for the pain to come."], "812": ["I remember “Does she or doesn’t she?”"], "1223": ["I remember (basketball) total frustration over how to “dribble.”"], "182": ["I remember “Queers can’t whistle.”"], "501": ["I remember felt jackets from Mexico with felt cut-outs of Mexicans taking siestas on the backs. And potted cactus plants on the pockets."], "289": ["I remember Greyhound buses at night."], "678": ["I remember Rosemary Clooney and Bing Crosby and “I’m Dreaming of a White Christmas.”"], "259": ["I remember “Any little kid could do that.”"], "747": ["I remember little electric fans that could “cut your fingers right off” if you got too close."], "1088": ["I remember big sponge dice dangling up front."], "249": ["I remember a roller coaster that went out over a lake."], "776": ["I remember a shoe store with a big brown x-ray machine that showed up the bones in your feet bright green."], "1318": ["I remember building unusual houses in my head. One, very modern and “organic,” was inside a cave. Another was mostly glass.", "And they all had giant bathrooms with giant sunken tubs."], "47": ["I remember “The Thing.”"], "480": ["I remember black heels on new shoes that mark up floors."], "811": ["I remember “Which twin has the Toni!”"], "1259": ["I remember fantasies of totally losing my voice and hearing and being able to communicate only by writing notes back and forth.", "(It was fun!)"], "520": ["I remember “7” and “14” and “13” and “21” and “69.”"], "738": ["I remember daydreams of being very charming and witty."], "453": ["I remember that Gene Kelly had no basket."], "160": ["I remember very long gloves."], "415": ["I remember stories about bodies being chopped up and disposed of in garbage disposals."], "79": ["I remember Cherokee haircuts."], "359": ["I remember long skinny colored glass decanters from Italy."], "345": ["I remember mistletoe."], "1039": ["I remember red plastic forks and green plastic forks."], "994": ["I remember horrible visions of that island where lepers were sent."], "932": ["I remember walking down the street, trying not to step on cracks."], "92": ["I remember selling blood every three months on Second Avenue."], "99": ["I remember when I worked in a snack bar and how much I hated people who ordered malts."], "1025": ["I remember what I remember most about restaurants when I was very young: french fries, straws, and toothpicks."], "1375": ["I remember a baby blue matching skirt and sweater that Suzy Barnes always wore. She was interested in science.", "All over her walls were advertising matchbook covers hanging on rolls of string. She had a great stamp collection too.", "Her mother and father were both over six feet tall. They belonged to a club for people over six feet tall only."], "875": ["I remember very tempting little ads in the backs of magazines for like say 25 dresses (“used” in very small print) for only one dollar!"], "654": ["I remember boat neck sweaters."], "90": ["I remember lightning."], "877": ["I remember daydreams of going with an absolutely knock-out girl, and impressing all my friends no end."], "1110": ["I remember, in signing off a letter, “Yours ’til the kitchen sinks.”"], "30": ["I remember when a fish-tail dress I designed was published in “Katy Keene” comics."], "223": ["I remember trying to convince my parents that not raking leaves was good for the grass."], "202": ["I remember that the minister’s son was wild."], "907": ["I remember, in art movies, two nuns walking by."], "194": ["I remember hearing stories about why Johnny Ray was such an unhappy person but I can’t remember what the stories were."], "717": ["I remember daydreams of having a twin."], "1295": ["I remember a ringworm epidemic and being scared to death that I would get it.", "If you got it they shaved off your hair and put green stuff all over your scalp."], "252": ["I remember Montgomery Clift in A Place in the Sun."], "1260": ["I remember running for vice-president and giving a campaign speech wearing my baby blue gabardine pants. I lost.", "That was junior high school."], "912": ["I remember once hearing about something called “Smell-A-Rama”: a movie with associated smells piped into the theater."], "813": ["I remember “There’s No Business Like Show Business” (the song) and how it always got to me."], "1188": ["I remember my mother talking about women who shouldn’t wear slacks."], "970": ["I remember “Necco Wafers” the pastel colors of chalk."], "1296": ["I remember “God Is Love Is Art Is Life.” I think I made that up in high school. Or else Ron Padgett did.", "At any rate I remember thinking it terribly profound."], "995": ["I remember “the green stuff” inside my first lobster."], "389": ["I remember little red feathers. That, I think, was the Red Cross."], "477": ["I remember bubble gum. Blowing big bubbles. And trying to get bubble gum out of my hair."], "821": ["I remember the little silver candlestick (Clue) and not knowing what a conservatory was."], "355": ["I remember chambray work shirts. And dirty tennis shoes with no socks."], "1062": ["I remember my mother cornering me into corners to squeeze out blackheads. (Hurt like hell.)"], "528": ["I remember Dole pineapple rings on a bed of lettuce with cottage cheese on top and sometimes a cherry on top of that."], "316": ["I remember opening jars that nobody else could open."], "503": ["I remember being allowed only sparklers. (And I remember only wanting sparklers.)"], "1103": ["I remember filling out a form once and not knowing what to put down for “race.”"], "446": ["I remember Howdy Doody and Queen for a Day."], "629": ["I remember not liking myself for not picking up boys I probably could pick up because of the possibility of being rejected."], "1265": ["I remember “hard” Christmas candy. Especially the ones with flower designs.", "I remember not liking the ones with jelly in the middle very much."], "1151": ["I remember “bread and butter” when something in the street divides you from the person you’re walking down the street with."], "700": ["I remember very long pigtails. And plaid ribbon bows."], "988": ["I remember catching myself with an expression on my face that doesn’t relate to what’s going on anymore."], "1082": ["I remember blowing straws."], "1145": ["I remember knowing what “c-a-n-d-y” meant long before I knew how to spell."], "1112": ["I remember (finger hooked in mouth) “Lady would you please hang your umbrella somewhere else?”"], "478": ["I remember eating dried airplane glue off my fingers. (Yum-yum.)"], "823": ["I remember when twins dressed alike."], "320": ["I remember stories of what hot dogs are made of."], "645": ["I remember that Nancy was the girl I lost the vice-presidency to."], "436": ["I remember wondering why anyone would want to be a doctor, and I still do."], "940": ["I remember that pinning a corsage onto a girl was always made into a joke. (Snicker-snicker.)"], "1032": ["I remember “French Post Cards.”"], "1144": ["I remember liking to impress sales clerks by paying no attention to price tags. And I still do."], "1241": ["I remember Christine Keeler and the “Profumo Affair.”"], "961": ["I remember cartoons about retrieving lost money from street gratings with chewing gum tied to the end of a piece of string."], "522": ["I remember predicting an airplane crash but nobody would listen. (Daydream.)"], "986": ["I remember learning very early in life the art of putting back everything exactly the way it was."], "227": ["I remember James Dean and his red nylon jacket."], "546": ["I remember examining my cock and balls very carefully once and finding them absolutely disgusting."], "653": ["I remember sweaters thrown over shoulders and sunglasses propped up on heads."], "374": ["I remember drawing pictures in church on pledge envelopes and programs."], "901": ["I remember the mostly unique to childhood problem of losing things through a hole in your pocket."], "335": ["I remember the first time I saw Elvis Presley. It was on The Ed Sullivan Show."], "728": ["I remember daydreams of saving someone from drowning and being a hero."], "135": ["I remember “come-as-you-are” parties. Everybody cheated."], "636": ["I remember pretending to be interested in pool."], "310": ["I remember laundromats at night all lit up with nobody in them."], "309": ["I remember that the only friends my parents had who owned a swimming pool also owned a funeral parlor."], "1097": ["I remember “Man Tan,” and orange stains on white shirts."], "786": ["I remember being afraid that the barber might slip and cut my ear."], "666": ["I remember Halloween."], "239": ["I remember peanut butter and banana sandwiches."], "26": ["I remember painting “I HATE TED BERRIGAN” in big black letters all over my white wall."], "449": ["I remember thinking about whether or not one should kill flies."], "254": ["I remember “The Swing” dance."], "472": ["I remember fruit cocktail."], "847": ["I remember big “Boy’s Town” stamps."], "513": ["I remember “Coming Attractions.” Company picnics. Two-car garages. And picture windows."], "1018": ["I remember red fingers from eating pistachio nuts."], "177": ["I remember the tiger lilies alongside the house. I found a dime among them once."], "675": ["I remember having my Christmas shopping list all made out before December."], "381": ["I remember toe jams. I never ate toe jams but I remember kids that did. I do remember eating snot. It tasted pretty good."], "964": ["I remember globes. Roll-down maps. And rubber-tipped wooden stick pointers."], "770": ["I remember a red liquid medicine for cuts in a little brown bottle that “won’t sting” but it always did."], "502": ["I remember the 4th of July. Sparklers. And stories about how dangerous firecrackers are."], "1091": ["I remember St. Christopher medals, on chains, around necks, that had nothing to do with being Catholic."], "262": ["I remember “You couldn’t give it to me.”"], "217": ["I remember a little boy down the street. Sometimes I would hide one of his toys inside my underwear and make him reach in for it."], "1354": ["I remember an algebra teacher who very generously passed me. His name was Mr. Byrd.", "I think he truly understood that algebra, for me, was totally out of the question, so he pretty much ignored me. (In a nice way.)", "He died the next year of cancer."], "849": ["I remember, when babies fall down, “oopsy-daisy.”"], "1302": ["I remember that one way to keep from smiling during communion was to think real hard about something very boring.", "Like how airplane engines work. Or tree trunks."], "178": ["I remember a very little doll I lost under the front porch and never found."], "1343": ["I remember one day in psychology class the teacher asked everyone who had regular bowel movements to raise their hand.", "I don’t remember if I had regular bowel movements or not but I do remember that I raised my hand."], "24": ["I remember an American history teacher who was always threatening to jump out of the window if we didn’t quiet down. (Second floor.)"], "693": ["I remember getting a thermometer stuck up my butt several times and the fear that it might fall in and get lost, or break off inside me."], "672": ["I remember orange and black jellybeans at Halloween. And pastel-colored ones for Easter."], "676": ["I remember the fear of not getting a present for someone who might give me one."], "323": ["I remember wondering why, if Jesus could cure sick people, why He didn’t cure all sick people."], "709": ["I remember “nigger babies.” Candy corn. And red hots."], "869": ["I remember wondering why your head didn’t get full of water through your ears and nose."], "850": ["I remember, with a limp wrist, shaking your hand back and forth real fast until it feels like jelly."], "455": ["I remember a color foldout pinup picture of Jane Russell lounging in a pile of straw in Esquire magazine with one bare shoulder."], "414": ["I remember miniature loaves of real bread the Bond Bread Company gave you when you went on a tour of their plant."], "1164": ["I remember Creamsicles and Fudgesicles and Popsicles that broke (usually) in two."], "727": ["I remember daydreams of living in a treehouse."], "1157": ["I remember making up abstract foreign languages, which sounded totally convincing, to me."], "762": ["I remember not understanding how very ugly or deformed people could stand it."], "741": ["I remember chicken fried steak."], "665": ["I remember Jack Frost. Pumpkin pie. Gourds. And very blue skies."], "1150": ["I remember making awful noises with a rose petal in my mouth, but the “how” of how to do it is something I don’t remember."], "1000": ["I remember glasses on top of satin eye masks."], "890": ["I remember sexy photos of Julie London on record covers."], "1146": ["I remember: “What’s your sign?”"], "743": ["I remember not trusting pressure cookers."], "973": ["I remember little pieces of colored ribbons pinned to blouses and sweaters that meant you were pledging to a social club."], "168": ["I remember the organ music from As the World Turns."], "465": ["I remember wondering if girls fart too."], "1168": ["I remember bright orange jars of cheese spread. And tiny tins of pink deviled ham."], "134": ["I remember pop beads."], "867": ["I remember in wood-working class making a magazine rack."], "80": ["I remember no belts."], "793": ["I remember when “beehives” really got out of hand."], "804": ["I remember linen dresses from behind after having sat through a sermon. Or a bridge party."], "34": ["I remember squaw dresses."], "461": ["I remember a big brown chewy thing on a stick that you could lick down to a very sharp point."], "45": ["I remember “The Tennessee Waltz.”"], "133": ["I remember house shoes, plaid flannel bath robes, and “Casper” the Friendly Ghost."], "686": ["I remember after opening packages what an empty day Christmas day is."], "1338": ["I remember affectionate squeezes in public from my father. Usually of a joke-strangle sort. And not knowing how to respond.", "So I’d turn red, with a big grin on my face, and look down until it was all over with."], "1365": ["I remember when Lenox China had an essay contest in connection with a local store that carried Lenox China.", "Whoever wrote the best essay about Lenox China was supposed to get a free place setting of their choice but I don’t remember anyone winning.", "I think somehow the contest got dropped."], "1319": ["I remember a rather horsy-looking girl who tried to seduce me on a New York City roof.", "Although I got it up, I really didn’t want to do anything, so I told her that I had a headache."], "531": ["I remember fancy yo-yos studded with rhinestones."], "554": ["I remember crossing your fingers behind your back when you tell a lie."], "1355": ["I remember, when my eyebrows began to spread over my nose bridge, thinking it might make me look a bit more like Montgomery Clift.", "(A bit more?)", "Yes—I just remembered—I did have a period of secretly thinking I slightly resembled Montgomery Clift."], "469": ["I remember a plate that hung on the wall above the T.V. set that said, “God Bless Our Mortgaged Home.”"], "104": ["I remember Miss Peabody, my grade school librarian."], "567": ["I remember not allowing myself to start on the candy until the feature started."], "224": ["I remember that I liked dandelions all over the yard."], "1001": ["I remember next-door neighbors who don’t keep up their lawns."], "1280": ["I remember Roman column props. Tilted-to-one-side sailor caps. Crude tattoos. Blank expressions. Suggestive G-string pouch shadows.", "And big flat feet."], "778": ["I remember that watermelon is 99% water."], "862": ["I remember fancy little bathroom towels not for using."], "644": ["I remember a pair of baby blue gabardine pants I especially liked."], "297": ["I remember small ugly modern churches."], "1349": ["I remember reading twelve books every summer so as to get a “certificate” from the local library.", "I didn’t give a shit about reading but I loved getting certificates. I remember picking books with big print and lots of pictures."], "923": ["I remember little suits, on little boys, with no lapels."], "1251": ["I remember how silly it all seems in the morning (again)."], "241": ["I remember the Box Car Twins."], "141": ["I remember rubbing my hand under a restaurant table top and feeling all the gum."], "1133": ["I remember a big Sunday lunch, a light Sunday night dinner, and in the morning—“school.”"], "991": ["I remember my mother picking up tiny specks of lint off things."], "999": ["I remember Halloween and the annual problem of whether to wear a mask or to see. (Glasses.)"], "1235": ["I remember “knock-knock” jokes. And Polish jokes. And a “What’s for dinner?” cannibal joke with a “Catholic soup!” reply."]}